{"abstract":{"entropy":6.209428765674049,"topics":["evolutionary algorithms, evolutionary computation, estimation distribution, evolutionary optimization, multi-objective evolutionary, multi-objective optimization, estimation edas, optimization algorithms, distribution edas, algorithms search, evolutionary problem, estimation algorithms, local search, multi-objective algorithms, genetic algorithms, evolutionary search, algorithms problem, distribution algorithms, multiobjective optimization, algorithms edas","particle swarm, learning classifier, optimization problem, swarm optimization, particle optimization, particle pso, swarm pso, ant colony, classifier systems, optimization algorithms, spanning tree, solving problem, differential evolution, optimization pso, paper algorithms, algorithms problem, scheduling problem, classifier xcs, traveling salesman, learning systems","neural networks, evolution strategies, learning systems, classifier systems, real world, immune systems, systems, artificial immune, research area, protein structure, quality software, recent years, inspired immune, protein prediction, xcs systems, forecasting series, artificial, software testing, complex problem, becoming increasingly","genetic algorithms, genetic programming, genetic gas, building blocks, presents approach, presents genetic, selection algorithms, data mining, algorithms gas, symbolic regression, cartesian programming, genetic evolve, approach based, crossover operators, paper genetic, use genetic, presents algorithms, genetic problem, describes genetic, novel approach","algorithms used, performance algorithms, genetic algorithms, evolutionary used, global optimization, fitness function, evolutionary fitness, algorithms fitness, diversity evolutionary, widely used, used optimization, diversity mechanism, used, widely problem, algorithms function, improve performance, used problem, known algorithms, solutions fitness, studies algorithms","evolutionary algorithms, evolutionary computation, algorithms search, evolutionary search, local search, evolutionary eas, presents evolutionary, search heuristics, search space, search, algorithms local, evolutionary techniques, evolutionary approach, techniques algorithms, genetic search, search problem, search optimization, evolutionary applied, evolutionary based, evolutionary problem","spanning tree, consider problem, graph problem, spanning problem, tree problem, minimum spanning, problem consists, randomized heuristics, minimum tree, extended compact, minimum problem, randomized search, algorithms graph, algorithms eas, optimization consists, tree, graph genetic, tree optimization, minimize number, algorithms ecga","optimization problem, algorithms problem, ant colony, solving problem, algorithms applied, scheduling problem, applied problem, presents problem, solve problem, combinatorial optimization, applied optimization, optimization algorithms, problem, colony aco, combinatorial problem, job shop, ant optimization, ant aco, colony optimization, solving optimization","evolution strategies, real world, research area, complex problem, evolution strategy, becoming increasingly, communication networks, application, active research, application problem, application evolutionary, evolution, successful testing, evolution evolutionary, testing world, application field, solving complex, real application, networks application, evolution step","quality software, detection problem, become popular, anomaly detection, intrusion detection, object-oriented software, pattern recognition, design systems, data web, become increasingly, presents detection, systems detection, quality systems, popular systems, recent research, systems field, become systems, learning systems, important, important problem","genetic algorithms, selection algorithms, building blocks, algorithms gas, genetic gas, genetic selection, genetic population, model genetic, algorithms model, selection, population size, algorithms population, negative selection, feature selection, clonal selection, algorithms cellular, building genetic, genetic individuals, cellular automata, model building","presents approach, presents genetic, approach based, genetic approach, algorithms based, novel approach, symbolic regression, work genetic, presents based, paper genetic, presents algorithms, use genetic, based genetic, genetic algorithms, presents novel, gene expression, approach programming, algorithms use, describes approach, work presents"],"ranking":[["57339|GECCO|2005|Not all linear functions are equally difficult for the compact genetic algorithm|Estimation of distribution algorithms (EDAs) try to solve an optimization problem by finding a probability distribution focussed around its optima. For this purpose they conduct a sampling-evaluation-adjustment cycle, where search points are sampled with respect to a probability distribution, which is adjusted according to the evaluation of the sampled points. Although there are many successful experiments suggesting the usefulness of EDAs, there are only few rigorous theoretical results apart from convergence results without time bounds. Here we present first rigorous runtime analyses of a simple EDA, the compact genetic algorithm, for linear pseudo-boolean functions on n variables. We prove a number of results showing that not all linear functions have the same asymptotical runtime.|Stefan Droste","57501|GECCO|2005|Real-coded crossover as a role of kernel density estimation|This paper presents a kernel density estimation method by means of real-coded crossovers. Estimation of density algorithms (EDAs) are evolutionary optimization techniques, which determine the sampling strategy by means of a parametric probabilistic density function estimated from the population. Real-coded Genetic Algorithm (RCGA) does not explicitly estimate any probabilistic distribution, however, the probabilistic model of the population is implicitly estimated by crossovers and the sampling strategy is determined by this implicit probabilistic model. Based on this understanding, we propose a novel density estimation algorithm by using crossovers as nonparametric kernels and apply this kernel density estimation to the Gaussian Mixture modeling. We show that the proposed method is superior in the robustness of the computation and in the accuracy of the estimation by the comparison of conventional EM estimation.|Jun Sakuma,Shigenobu Kobayashi","58536|GECCO|2008|Using previous models to bias structural learning in the hierarchical BOA|Estimation of distribution algorithms (EDAs) are stochastic optimization techniques that explore the space of potential solutions by building and sampling probabilistic models of promising candidate solutions. While the primary goal of applying EDAs is to discover the global optimum (or an accurate approximation), any EDA also provides us with a sequence of probabilistic models, which hold a great deal of information about the problem. Although using problem-specific knowledge has been shown to significantly improve performance of EDAs and other evolutionary algorithms, this readily available source of information has been largely ignored by the EDA community. This paper takes the first step towards the use of probabilistic models obtained by EDAs to speed up the solution of similar problems in the future. More specifically, we propose two approaches to biasing model building in the hierarchical Bayesian optimization algorithm (hBOA) based on knowledge automatically learned from previous runs on similar problems. We show that the methods lead to substantial speedups and argue that they should work well in other applications that require solving a large number of problems with similar structure.|Mark Hauschild,Martin Pelikan,Kumara Sastry,David E. Goldberg","57456|GECCO|2005|A comparison study between genetic algorithms and bayesian optimize algorithms by novel indices|Genetic Algorithms (GAs) are a search and optimization technique based on the mechanism of evolution. Recently, another sort of population-based optimization method called Estimation of Distribution Algorithms (EDAs) have been proposed to solve the GA's defects. Although several comparison studies between GAs and EDAs have been made, little is known about differences of statistical features between them. In this paper, we propose new statistical indices which are based on the concepts of crossover and mutation, used in GAs, to analyze the behavior of the population based optimization techniques. We also show simple results of comparison studies between GAs and the Bayesian Optimization Algorithm (BOA), a well-known Estimation of Distribution Algorithms (EDAs).|Naoki Mori,Masayuki Takeda,Keinosuke Matsumoto","57750|GECCO|2006|Does overfitting affect performance in estimation of distribution algorithms|Estimation of Distribution Algorithms (EDAs) are a class of evolutionary algorithms that use machine learning techniques to solve optimization problems. Machine learning is used to learn probabilistic models of the selected population. This model is then used to generate next population via sampling. An important phenomenon in machine learning from data is called overfitting. This occurs when the model is overly adapted to the specifics of the training data so well that even noise is encoded. The purpose of this paper is to investigate whether overfitting happens in EDAs, and to discover its consequences. What is found is overfitting does occur in EDAs overfitting correlates to EDAs performance reduction of overfitting using early stopping can improve EDAs performance.|Hao Wu,Jonathan L. Shapiro","57232|GECCO|2003|The Structure of Evolutionary Exploration On Crossover Buildings Blocks and Estimation-Of-Distribution Algorithms|Correlations between alleles after selection are an important source of information. Such correlations should be exploited for further search and thereby constitute the building blocks of evolutionary exploration. With this background we analyze the structure of the offspring probability distribution, or exploration distribution, for a simple GA with mutation only and a crossover GA and compare them to Estimation-Of-Distribution Algorithms (EDAs). This will allow a precise characterization of the structure of exploration w.r.t. correlations in the search distribution for these algorithms. We find that crossover transforms, depending on the crossover mask, mutual information between loci into entropy. In total, it can only decrease such mutual information. In contrast, the objective of EDAs is to estimate the correlations between loci and exploit this information during exploration. This may lead to an effective increase of mutual information in the exploration distribution, what we define correlated exploration.|Marc Toussaint","57789|GECCO|2006|Optimising cancer chemotherapy using an estimation of distribution algorithm and genetic algorithms|This paper presents a methodology for using heuristic search methods to optimise cancer chemotherapy. Specifically, two evolutionary algorithms - Population Based Incremental Learning (PBIL), which is an Estimation of Distribution Algorithm (EDA), and Genetic Algorithms (GAs) have been applied to the problem of finding effective chemotherapeutic treatments. To our knowledge, EDAs have been applied to fewer real world problems compared to GAs, and the aim of the present paper is to expand the application domain of this technique.We compare and analyse the performance of both algorithms and draw a conclusion as to which approach to cancer chemotherapy optimisation is more efficient and helpful in the decision-making activity led by the oncologists.|Andrei Petrovski,Siddhartha Shakya,John A. W. McCall","58829|GECCO|2009|Mining probabilistic models learned by EDAs in the optimization of multi-objective problems|One of the uses of the probabilistic models learned by estimation of distribution algorithms is to reveal previous unknown information about the problem structure. In this paper we investigate the mapping between the problem structure and the dependencies captured in the probabilistic models learned by EDAs for a set of multi-objective satisfiability problems. We present and discuss the application of different data mining and visualization techniques for processing and visualizing relevant information from the structure of the learned probabilistic models. We show that also in the case of multi-objective optimization problems, some features of the original problem structure can be translated to the probabilistic models and unveiled by using algorithms that mine the model structures.|Roberto Santana,Concha Bielza,Jos√© Antonio Lozano,Pedro Larra√±aga","57103|GECCO|2003|Hybridization of Estimation of Distribution Algorithms with a Repair Method for Solving Constraint Satisfaction Problems|Estimation of Distribution Algorithms (EDAs) are new promising methods in the field of genetic and evolutionary algorithms. In the case of conventional Genetic and Evolutionary Algorithm studies to apply Constraint Satisfaction Problems (CSPs), it is well-known that the incorporation of the domain knowledge in the CSPs is quite effective. In this paper, we propose a hybridization method (memetic algorithm) of Estimation of Distribution Algorithms with a repair method. Experimental results on general CSPs tell us the effectiveness of the proposed method.|Hisashi Handa","57674|GECCO|2006|The correlation-triggered adaptive variance scaling IDEA|It has previously been shown analytically and experimentally that continuous Estimation of Distribution Algorithms (EDAs) based on the normal pdf can easily suffer from premature convergence. This paper takes a principled first step towards solving this problem. First, prerequisites for the successful use of search distributions in EDAs are presented. Then, an adaptive variance scaling theme is introduced that aims at reducing the risk of premature convergence. Integrating the scheme into the iterated density--estimation evolutionary algorithm (IDEA) yields the correlation-triggered adaptive variance scaling IDEA (CT-AVS-IDEA). The CT-AVS-IDEA is compared to the original IDEA and the Evolution Strategy with Covariance Matrix Adaptation (CMA-ES) on a wide range of unimodal test-problems by means of a scalability analysis. It is found that the average number of fitness evaluations grows subquadratically with the dimensionality, competitively with the CMA-ES. In addition, CT-AVS-IDEA is indeed found to enlarge the class of problems that continuous EDAs can solve reliably.|J√∂rn Grahl,Peter A. N. Bosman,Franz Rothlauf"],["57826|GECCO|2006|PSO and multi-funnel landscapes how cooperation might limit exploration|Particle Swarm Optimization (PSO) is a population-based optimization method in which search points employ a cooperative strategy to move toward one another. In this paper we show that PSO appears to work well on \"single-funnel\" optimization functions. On more complex optimization problems, PSO tends to converge too quickly and then fail to make further progress. We contend that most benchmarks for PSO have classically been demonstrated on single-funnel functions. However, in practice, optimization tasks are more complex and possess higher problem dimensionality. We present empirical results that support our conjecture that PSO performs well on single-funnel functions but tends to stagnate on more complicated landscapes.|Andrew M. Sutton,Darrell Whitley,Monte Lunacek,Adele E. Howe","57331|GECCO|2005|An efficient evolutionary algorithm applied to the design of two-dimensional IIR filters|This paper presents an efficient technique of designing two-dimensional IIR digital filters using a new algorithm involving the tightly coupled synergism of particle swarm optimization and differential evolution. The design task is reformulated as a constrained minimization problem and is solved by our newly developed PSO-DV (Particle Swarm Optimizer with Differentially perturbed Velocity) algorithm. Numerical results are presented. The paper also demonstrates the superiority of the proposed design method by comparing it with two recently published filter design methods.|Swagatam Das,Amit Konar,Uday Kumar Chakraborty","57240|GECCO|2003|Optimization Using Particle Swarms with Near Neighbor Interactions|This paper presents a modification of the particle swarm optimization algorithm (PSO) intended to combat the problem of premature convergence observed in many applications of PSO. In the new algorithm, each particle is attracted towards the best previous positions visited by its neighbors, in addition to the other aspects of particle dynamics in PSO. This is accomplished by using the ratio of the relative fitness and the distance of other particles to determine the direction in which each component of the particle position needs to be changed. The resulting algorithm, known as Fitness-Distance-Ratio based PSO (FDR-PSO), is shown to perform significantly better than the original PSO algorithm and several of its variants, on many different benchmark optimization problems. Avoiding premature convergence allows FDR-PSO to continue search for global optima in difficult multimodal optimization problems, reaching better solutions than PSO and several of its variants.|Kalyan Veeramachaneni,Thanmaya Peram,Chilukuri K. Mohan,Lisa Ann Osadciw","58696|GECCO|2009|Geometric differential evolution|Geometric Particle Swarm Optimization (GPSO) is a recently introduced formal generalization of traditional Particle Swarm Optimization (PSO) that applies naturally to both continuous and combinatorial spaces. Differential Evolution (DE) is similar to PSO but it uses different equations governing the motion of the particles. This paper generalizes the DE algorithm to combinatorial search spaces extending its geometric interpretation to these spaces, analogously as what was done for the traditional PSO algorithm. Using this formal algorithm, Geometric Differential Evolution (GDE), we formally derive the specific GDE for the Hamming space associated with binary strings and present experimental results on a standard benchmark of problems.|Alberto Moraglio,Julian Togelius","58025|GECCO|2007|A heuristic particle swarm optimization|A heuristic version of the particle swarm optimization (PSO) is introduced in this paper. In this new method called \"The heuristic particle swarm optimization(HPSO)\", we use heuristics to choose the next particle to update its velocity and position. By using heuristics , the convergence rate to local minimum is faster. To avoid premature convergence of the swarm, the particles are re-initialized with random velocity when moving too close to the global best position. The combination of heuristics and re-initialization mechanism make HPSO outperform the basic PSO and recent versions of PSO.|Hoang Thanh Lam,Popova Nina Nicolaevna,Nguyen Thoi Minh Quan","59071|GECCO|2010|An parallel particle swarm optimization approach for multiobjective optimization problems|This paper proposes a parallel particle swarm optimization (PPSO) to solve the multiobjective optimization problems (MOP). PPSO makes the use of the parallel characteristic of the PSO algorithm to deal with the multiple objectives issue of the MOP. PPSO uses as many swarms as the number of the objectives in the MOP and lets each swarm optimize only one of the objectives. These swarms work in parallel and each swarm can use a standard PSO or any other improved PSO variants to solve a single objective problem. PPSO has advantages on the following two aspects. First, as each swarm focus on optimizing only one objective, PPSO can avoid the difficulty of fitness assignment because the particles can be evaluated like in the single objective optimization problem. Second, as different swarms optimize different objectives, PPSO can maintain the population diversity to make a throughout search along the whole Pareto front to obtain nondominated solutions as many as possible. The performance of PPSO is tested on a set of benchmark problems complicated Pareto sets in CEC. The experimental results compared with those obtained by the state-of-the-art algorithms demonstrate the effectiveness and efficiency of PPSO, showing the good performance of PPSO in solving the MOP with complicated Pareto sets.|Zhi-hui Zhan,Jun Zhang","57585|GECCO|2005|Constrained optimization via particle evolutionary swarm optimization algorithm PESO|We introduce the PESO (Particle Evolutionary Swarm Optimization) algorithm for solving single objective constrained optimization problems. PESO algorithm proposes two new perturbation operators \"c-perturbation\" and \"m-perturbation\". The goal of these operators is to fight premature convergence and poor diversity issues observed in Particle Swarm Optimization (PSO) implementations. Constraint handling is based on simple feasibility rules. PESO is compared with respect to a highly competitive technique representative of the state-of-the-art in the area using a well-known benchmark for evolutionary constrained optimization. PESO matches most results and outperforms other PSO algorithms.|Angel Eduardo Mu√±oz Zavala,Arturo Hern√°ndez Aguirre,Enrique Ra√∫l Villa Diharce","57976|GECCO|2007|A discrete particle swarm optimization algorithm for the generalized traveling salesman problem|Dividing the set of nodes into clusters in the well-known traveling salesman problem results in the generalized traveling salesman problem which seeking a tour with minimum cost passing through only a single node from each cluster. In this paper, a discrete particle swarm optimization is presented to solve the problem on a set of benchmark instances. The discrete particle swarm optimization algorithm exploits the basic features of its continuous counterpart. It is also hybridized with a local search, variable neighborhood descend algorithm, to further improve the solution quality. In addition, some speed-up methods for greedy node insertions are presented. The discrete particle swarm optimization algorithm is tested on a set of benchmark instances with symmetric distances up to  nodes from the literature. Computational results show that the discrete particle optimization algorithm is very promising to solve the generalized traveling salesman problem.|Mehmet Fatih Tasgetiren,Ponnuthurai N. Suganthan,Quan-Qe Pan","57433|GECCO|2005|MeSwarm memetic particle swarm optimization|In this paper, a novel variant of particle swarm optimization (PSO), named memetic particle swarm optimization algorithm (MeSwarm), is proposed for tackling the overshooting problem in the motion behavior of PSO. The overshooting problem is a phenomenon in PSO due to the velocity update mechanism of PSO. While the overshooting problem occurs, particles may be led to wrong or opposite directions against the direction to the global optimum. As a result, MeSwarm integrates the standard PSO with the Solis and Wets local search strategy to avoid the overshooting problem and that is based on the recent probability of success to efficiently generate a new candidate solution around the current particle. Thus, six test functions and a real-world optimization problem, the flexible protein-ligand docking problem are used to validate the performance of MeSwarm. The experimental results indicate that MeSwarm outperforms the standard PSO and several evolutionary algorithms in terms of solution quality.|Bo-Fu Liu,Hung-Ming Chen,Jian-Hung Chen,Shiow-Fen Hwang,Shinn-Ying Ho","58697|GECCO|2009|Estimation of particle swarm distribution algorithms bringing together the strengths of PSO and EDAs|This paper presents a framework of estimation of particle swarm distribution algorithms (EPSDAs). The aim lies in effectively combining particle swarm optimization (PSO) with estimation of distribution algorithms (EDAs) without losing on their unique features. To exhibit its practicability, an extended compact particle swarm optimization (EcPSO) is developed along the lines of the suggested framework. Empirical results have adduced grounds for its effectiveness.|Chang Wook Ahn,Hyun-Tae Kim"],["57595|GECCO|2006|Coordination number prediction using learning classifier systems performance and interpretability|The prediction of the coordination number (CN) of an amino acid in a protein structure has recently received renewed attention. In a recent paper, Kinjo et al. proposed a real-valued definition of CN and a criterion to map it onto a finite set of classes, in order to predict it using classification approaches. The literature reports several kinds of input information used for CN prediction. The aim of this paper is to assess the performance of a state-of-the-art learning method, Learning Classifier Systems (LCS) on this CN definition, with various degrees of precision, based on several combinations of input attributes. Moreover, we will compare the LCS performance to other well-known learning techniques. Our experiments are also intended to determinethe minimum set of input information needed to achieve good predictive performance, so as to generate competent yet simple and interpretable classification rules. Thus, the generated predictors (rule sets) are analyzed for their interpretability.|Jaume Bacardit,Michael Stout,Natalio Krasnogor,Jonathan D. Hirst,Jacek Blazewicz","58918|GECCO|2010|The baldwin effect in developing neural networks|The Baldwin Effect is a very plausible, but unproven, biological theory concerning the power of learning to accelerate evolution. Simple computational models in the 's gave the first constructive proof of its potential existence, and subsequent work in evolutionary computation has shown the practical, computational, advantages of hybrid evolution-learning systems. However, the basic theory, particularly its second phase (involving genetic assimilation of acquired characteristics) is difficult to reconcile in systems controlled by neural networks, particularly those that arise from their genotypes via a complex developmental process. Our research uses new evidence of the blurred distinction between development and learning in natural neural systems as the basis for an abstract model displaying the Baldwin Effect in artificial neural networks that evolve, develop and learn.|Keith L. Downing","57536|GECCO|2005|On the contribution of gene libraries to artificial immune systems|Gene libraries have been added to Artificial Immune Systems in analogy to biological immune systems, but to date no careful study of their effect has been made. This work investigates the contribution of gene libraries to Artificial Immune Systems by reproducing and extending an earlier system that used gene libraries. Performance on a job-shop scheduling problem is evaluated empirically with and without gene libraries, and with many different library configurations. We propose that gene libraries encourage diversity in a population of solutions and that the number of components in the gene library parameterises this effect. The number of gene libraries used is found to affect solution fitness and indeed using larger numbers of libraries (and therefore libraries of smaller components) enables higher fitness to be attained. We conclude that gene libraries are likely to be of use in applications where there is a need to maintain the diversity of solutions.|Peter Spellward,Tim Kovacs","57098|GECCO|2003|The Effect of Binary Matching Rules in Negative Selection|Negative selection algorithm is one of the most widely used techniques in the field of artificial immune systems. It is primarily used to detect changes in databehavior patterns by generating detectors in the complementary space (from given normal samples). The negative selection algorithm generally uses binary matching rules to generate detectors. The purpose of the paper is to show that the low-level representation of binary matching rules is unable to capture the structure of some problem spaces. The paper compares some of the binary matching rules reported in the literature and study how they behave in a simple two-dimensional real-valued space. In particular, we study the detection accuracy and the areas covered by sets of detectors generated using the negative selection algorithm.|Fabio A. Gonz√°lez,Dipankar Dasgupta,Jonatan G√≥mez","58382|GECCO|2008|Context-dependent predictions and cognitive arm control with XCSF|While John Holland has always envisioned learning classifier systems (LCSs) as cognitive systems, most work on LCSs has focused on classification, datamining, and function approximation. In this paper, we show that the XCSF classifier system can be very suitably modified to control a robot system with redundant degrees of freedom, such as a robot arm. Inspired by recent research insights that suggest that sensorimotor codes are nearly ubiquitous in the brain and an essential ingredient for cognition in general, the XCSF system is modified to learn classifiers that encode piecewise linear sensorimotor structures, which are conditioned on prediction-relevant contextual input. In the investigated robot arm problem, we show that XCSF partitions the (contextual) posture space of the arm in such a way that accurate hand movements can be predicted given particular motor commands. Furthermore, we show that the inversion of the sensorimotor predictive structures enables accurate goal-directed closed-loop control of arm reaching movements. Besides the robot arm application, we also investigate performance of the modified XCSF system on a set of artificial functions. All results point out that XCSF is a useful tool to evolve problem space partitions that are maximally effective for the encoding of sensorimotor dependencies. A final discussion elaborates on the relation of the taken approach to actual brain structures and cognitive psychology theories of learning and behavior.|Martin V. Butz,Oliver Herbort","58128|GECCO|2007|Suppression based immune mechanism to find arepresentative training set in data classification tasks|This article proposes a new classifier inspired by a biolog-ical immune systems' characteristic which also belongs tothe class of k-nearest-neighbors algorithms. Its main fea-ture is a suppression mechanism used to reduce the size of the training set maintaining the most significative sampleswithout loosing much capability of generalization.|Grazziela Patrocinio Figueredo,Nelson F. F. Ebecken,Helio J. C. Barbosa","57182|GECCO|2003|Developing an Immunity to Spam|Immune systems protect animals from pathogens, so why not apply a similar model to protect computers Several researchers have investigated the use of an artificial immune system to protect computers from viruses and others have looked at using such a system to detect unauthorized computer intrusions. This paper describes the use of an artificial immune system for another kind of protection protection from unsolicited email, or spam.|Terri Oda,Tony White","57551|GECCO|2005|From supervised ranking to evolving behaviours of a robotic team|Using artificial evolution successfully to design behaviours of multiple robot systems has been reported in recent years. Most of such reports are focused on the design of low level controllers. Design of high level team coordination strategies is rarely covered perhaps because the design of an appropriate chromosome representation for a complex multi-agent system is not an easy task. In this paper we propose that by treating the action decisions of every team member as a supervised ranking problem, the chromosome design problem can be solved systematically.We have tested this approach by dynamically solving the problems in the Solomon's benchmark of Vehicle Routing Problem with Time Windows . Experiments show that our approach can create some simple behaviours which, whilst not optimal, are robust and above average in quality.|Kai Wing Tang,Ray A. Jarvis","57465|GECCO|2005|The application of antigenic search techniques to time series forecasting|Time series have been a major topic of interest and analysis for hundreds of years, with forecasting a central problem. A large body of analysis techniques has been developed, particularly from methods in statistics and signal processing. Evolutionary techniques have only recently have been applied to time series problems. To date, applications of artificial immune system (AIS) techniques have been in the area of anomaly detection. In this paper we apply AIS techniques to the forecasting problem. We characterize a class of search algorithms we call antigenic search and show their ability to give a good forecast of next elements in series generated from Mackey-Glass and Lorenz equations.|Ian Nunn,Tony White","57781|GECCO|2006|An open-set speaker identification system using genetic learning classifier system|This paper presents the design and implementation of an adaptive open-set speaker identification system with genetic learning classifier systems. One of the challenging problems in using learning classifier systems for numerical problems is the knowledge representation. The voice samples are a series of real numbers that must be encoded in a classifier format. We investigate several different methods for representing voice samples for classifier systems and study the efficacy of the methods. We also identify several challenges for learning classifier systems in the speaker identification problem and introduce new methods to improve the learning and classification abilities of the systems. Experimental results show that our system successfully learns  voice features at the accuracies of % to %, which is considered a strong result in the speaker identification community. This research presents the feasibility of using learning classifier systems for the speaker identification problem.|WonKyung Park,Jae C. Oh,Misty K. Blowers,Matt B. Wolf"],["57206|GECCO|2003|A Hybrid Genetic Algorithm Based on Complete Graph Representation for the Sequential Ordering Problem|A hybrid genetic algorithm is proposed for the sequential ordering problem. It is known that the performance of a genetic algorithm depends on the survival environment and the reproducibility of building blocks. For decades, various chromosomal structures and crossover operators were proposed for the purpose. In this paper, we use Voronoi quantized crossover that adopts complete graph representation. It showed remarkable improvement in comparison with state-of-the-art genetic algorithms.|Dong-il Seo,Byung Ro Moon","58578|GECCO|2009|Estimating the distribution and propagation of genetic programming building blocks through tree compression|Shin et al  and McKay et al  previously applied tree compression and semantics-based simplification to study the distribution of building blocks in evolving Genetic Programming populations. However their method could only give static estimates of the degree of repetition of building blocks in one generation at a time, supplying no information about the flow of building blocks between generations. Here, we use a state-of-the-art tree compression algorithm, xmlppm, to estimate the extent to which frequent building blocks from one generation are still in use in a later generation. While they compared the behaviour of different GP algorithms on one specific problem -- a simple symbolic regression problem -- we extend the analysis to a more complex problem, a symbolic regression problem to find a Fourier approximation to a sawtooth wave, and to a Boolean domain, odd parity.|Robert I. McKay,Xuan Hoai Nguyen,James R. Cheney,MinHyeok Kim,Naoki Mori,Tuan Hao Hoang","58345|GECCO|2008|Deriving evaluation metrics for applicability of genetic algorithms to optimization problems|This paper aims to identify the missing links from theory of Genetic Algorithms (GAs) to application of GAs.|Hsinyi Jiang,Carl K. Chang","58638|GECCO|2009|Data-intensive computing for competent genetic algorithms a pilot study using meandre|Data-intensive computing has positioned itself as a valuable programming paradigm to efficiently approach problems requiring processing very large volumes of data. This paper presents a pilot study about how to apply the data-intensive computing paradigm to evolutionary computation algorithms. Two representative cases (selectorecombinative genetic algorithms and estimation of distribution algorithms) are presented, analyzed, and discussed. This study shows that equivalent data-intensive computing evolutionary computation algorithms can be easily developed, providing robust and scalable algorithms for the multicore-computing era. Experimental results show how such algorithms scale with the number of available cores without further modification.|Xavier Llor√†","58607|GECCO|2009|An evolutionary approach to constructive induction for link discovery|This paper presents a genetic programming-based symbolic regression approach to the construction of relational features in link analysis applications. Specifically, we consider the problems of predicting, classifying and annotating friends relations in friends networks, based upon features constructed from network structure and user profile data. We first document a data model for the blog service LiveJournal, and define a set of machine learning problems such as predicting existing links and estimating inter-pair distance. Next, we explain how the problem of classifying a user pair in a social network, as directly connected or not, poses the problem of selecting and constructing relevant features. We use genetic programming to construct features, represented by multiple symbol trees with base features as their leaves. In this manner, the genetic program selects and constructs features that may not have been originally considered, but possess better predictive properties than the base features. Finally, we present classification results and compare these results with those of the control and similar approaches.|Tim Weninger,William H. Hsu,Jing Xia,Waleed Aljandal","57789|GECCO|2006|Optimising cancer chemotherapy using an estimation of distribution algorithm and genetic algorithms|This paper presents a methodology for using heuristic search methods to optimise cancer chemotherapy. Specifically, two evolutionary algorithms - Population Based Incremental Learning (PBIL), which is an Estimation of Distribution Algorithm (EDA), and Genetic Algorithms (GAs) have been applied to the problem of finding effective chemotherapeutic treatments. To our knowledge, EDAs have been applied to fewer real world problems compared to GAs, and the aim of the present paper is to expand the application domain of this technique.We compare and analyse the performance of both algorithms and draw a conclusion as to which approach to cancer chemotherapy optimisation is more efficient and helpful in the decision-making activity led by the oncologists.|Andrei Petrovski,Siddhartha Shakya,John A. W. McCall","57960|GECCO|2007|A new crossover technique for Cartesian genetic programming|Genetic Programming was first introduced by Koza using tree representation together with a crossover technique in which random sub-branches of the parents' trees are swapped to create the offspring. Later Miller and Thomson introduced Cartesian Genetic Programming, which uses directed graphs as a representation to replace the tree structures originally introduced by Koza. Cartesian Genetic Programming has been shown to perform better than the traditional Genetic Programming but it does not use crossover to create offspring, it is implemented using mutation only. In this paper a new crossover method in Genetic Programming is introduced. The new technique is based on an adaptation of the Cartesian Genetic Programming representation and is tested on two simple regression problems. It is shown that by implementing the new crossover technique, convergence is faster than that of using mutation only in the Cartesian Genetic Programming method.|Janet Clegg,James Alfred Walker,Julian Francis Miller","58818|GECCO|2009|Optimal designs of ambiguous mobile keypad with alphabetical constraints|We address the problem of finding multitap-based optimal keypad designs. This paper presents novel alphabetically-constrained keypad designs, which are optimized on real-world SMS message data by dynamic programming and genetic algorithms. When compared with traditional designs, the proposed ones improved them by about  to  percent.|Hyumin Kim,Yong-Hyuk Kim","57027|GECCO|2003|Real-Parameter Genetic Algorithms for Finding Multiple Optimal Solutions in Multi-modal Optimization|The aim of this paper is to identify Genetic Algorithms (GAs) which perform well over a range of continuous and smooth multimodal real-variable functions. In our study, we focus on testing GAs combining three classes of genetic operators selection, crossover and replacement. The approach followed is time-constrained and thus our stopping criterion is a fixed number of generations. Results show that GAs with random selection of parents and crowding replacement are robust optimizers. By contrast, GAs with tournament selection of parents and random replacement perform poorly in comparison.|Pedro J. Ballester,Jonathan N. Carter","57431|GECCO|2005|Combining competent crossover and mutation operators a probabilistic model building approach|This paper presents an approach to combine competent crossover and mutation operators via probabilistic model building. Both operators are based on the probabilistic model building procedure of the extended compact genetic algorithm (eCGA). The model sampling procedure of eCGA, which mimics the behavior of an idealized recombination---where the building blocks (BBs) are exchanged without disruption---is used as the competent crossover operator. On the other hand, a recently proposed BB-wise mutation operator---which uses the BB partition information to perform local search in the BB space---is used as the competent mutation operator. The resulting algorithm, called hybrid extended compact genetic algorithm (heCGA), makes use of the problem decomposition information for () effective recombination of BBs and () effective local search in the BB neighborhood. The proposed approach is tested on different problems that combine the core of three well known problem difficulty dimensions deception, scaling, and noise. The results show that, in the absence of domain knowledge, the hybrid approach is more robust than either single-operator-based approach.|Cl√°udio F. Lima,Kumara Sastry,David E. Goldberg,Fernando G. Lobo"],["57127|GECCO|2003|A Similarity-Based Mating Scheme for Evolutionary Multiobjective Optimization|This paper proposes a new mating scheme for evolutionary multiobjective optimization (EMO), which simultaneously improves the convergence speed to the Pareto-front and the diversity of solutions. The proposed mating scheme is a two-stage selection mechanism. In the first stage, standard fitness-based selection is iterated for selecting a pre-specified number of candidate solutions from the current population. In the second stage, similarity-based tournament selection is used for choosing a pair of parents among the candidate solutions selected in the first stage. For maintaining the diversity of solutions, selection probabilities of parents are biased toward extreme solutions that are different from prototypical (i.e., average) solutions. At the same time, our mating scheme uses a mechanism where similar parents are more likely to be chosen for improving the convergence speed to the Pareto-front. Through computational experiments on multi-objective knapsack problems, it is shown that the performance of recently proposed well-known EMO algorithms (SPEA and NSGA-II) can be improved by our mating scheme.|Hisao Ishibuchi,Youhei Shibata","58026|GECCO|2007|A multimodal particle swarm optimizer based on fitness Euclidean-distance ratio|One of the most critical issues that remains to be fully addressed in existing multimodal evolutionary algorithms is the difficulty in pre-specifying parameters used for estimating how far apart optima are. These parameters are typically represented as some sorts of niching parameters in existing EAs. Without prior knowledge of a problem, it is almost impossible to determine appropriate values for such niching parameters. This paper proposes a PSO for multimodal optimization that removes the need of these niching parameters. Our results show that the proposed algorithm, Fitness Euclidean-distance Ratio based PSO (FER-PSO) is able to reliably locate multiple global optima on the search landscape over some widely used multimodal optimization test functions, given that the population size is sufficiently large.|Xiaodong Li","58987|GECCO|2010|Adaptive strategy selection in differential evolution|Differential evolution (DE) is a simple yet powerful evolutionary algorithm for global numerical optimization. Different strategies have been proposed for the offspring generation but the selection of which of them should be applied is critical for the DE performance, besides being problem-dependent. In this paper, the probability matching technique is employed in DE to autonomously select the most suitable strategy while solving the problem. Four credit assignment methods, that update the known performance of each strategy based on the relative fitness improvement achieved by its recent applications, are analyzed. To evaluate the performance of our approach, thirteen widely used benchmark functions are used. Experimental results confirm that our approach is able to adaptively choose the suitable strategy for different problems. Compared to classical DE algorithms and to a recently proposed adaptive scheme (SaDE), it obtains better results in most of the functions, in terms of the quality of the final results and convergence speed.|Wenyin Gong,√?lvaro Fialho,Zhihua Cai","57842|GECCO|2006|Pairwise sequence comparison for fitness evaluation in evolutionary structural software testing|Evolutionary algorithms are among the metaheuristic search methods that have been applied to the structural test data generation problem. Fitness evaluation methods play an important role in the performance of evolutionary algorithms and various methods have been devised for this problem. In this paper, we propose a new fitness evaluation method based on pairwise sequence comparison also used in bioinformatics. Our preliminary study shows that this method is easy to implement and produces promising results.|H. Turgut Uyar,A. Sima Etaner-Uyar,A. Emre Harmanci","58952|GECCO|2010|A grid-based fitness strategy for evolutionary many-objective optimization|Grid has been widely used in the field of evolutionary multi-objective optimization (EMO) due to its property combining convergence and diversity naturally. Most EMO algorithms of grid-based fitness perform well on problems with two or three objectives, but encounter difficulties in their scalability to many-objective optimization. This paper develops the potential of using grid technique to balance convergence and diversity in fitness for many-objective optimization problems. To strengthen selection pressure and refine comparison level, three hierarchical grid-based criterions are incorporated into fitness to establish a completer order among individuals. Moreover, an adaptive fitness penalty mechanism in environmental selection is employed to guarantee the diversity of archive memory. Based on an extensive comparative study with three other EMO algorithms, the proposed algorithm is found to be remarkably successful in finding well-converged and well-distributed solution set.|Miqing Li,Jinhua Zheng,Ruimin Shen,Ke Li,Qizhao Yuan","57485|GECCO|2005|Understanding cooperative co-evolutionary dynamics via simple fitness landscapes|Cooperative co-evolution is often used to solve difficult optimization problems by means of problem decomposition. Its performance for such tasks can vary widely from good to disappointing. One of the reasons for this is that attempts to improve co-evolutionary performance using traditional EC analysis techniques often fail to provide the necessary insights into the dynamics of co-evolutionary systems, a key factor affecting performance. In this paper we use two simple fitness landscapes to illustrate the importance of taking a dynamical systems approach to analyzing co-evolutionary algorithms in order to understand them better and to improve their problem solving performance.|Elena Popovici,Kenneth A. De Jong","58436|GECCO|2008|Theoretical analysis of diversity mechanisms for global exploration|Maintaining diversity is important for the performance of evolutionary algorithms. Diversity mechanisms can enhance global exploration of the search space and enable crossover to find dissimilar individuals for recombination. We focus on the global exploration capabilities of mutation-based algorithms. Using a simple bimodal test function and rigorous runtime analyses, we compare well-known diversity mechanisms like deterministic crowding, fitness sharing, and others with a plain algorithm without diversification. We show that diversification is necessary for global exploration, but not all mechanisms succeed in finding both optima efficiently.|Tobias Friedrich,Pietro Simone Oliveto,Dirk Sudholt,Carsten Witt","58422|GECCO|2008|Application domain study of evolutionary algorithms in optimization problems|This paper deals with the problem of comparing and testing evolutionary algorithms, that is, the benchmarking problem, from an analysis point of view. A practical study of the application domain of four representative evolutionary algorithms is carried out using a relevant set of real-parameter function optimization benchmarks. The four selected algorithms are the Covariance Matrix Adaptation Evolution Strategy (CMA-ES) and the Differential Evolution (DE), due to their successful results in recent studies, a Genetic Algorithm with real parameter operators, used here as a reference approach because it is probably the most familiar to researchers, and the Macroevolutionary algorithm (MA), which is not widely known but it shows a very remarkable behavior in some problems. The algorithms have been compared running several tests over the benchmark function set to analyze their capabilities from a practical point of view, in other words, in terms of their usability. The characterization of the algorithms is based on accuracy, stability and time consumption parameters thus establishing their operational scope and the type of optimization problems they are more suitable for.|Pilar Caama√±o,Francisco Bellas,Jos√© Antonio Becerra,Richard J. Duro","57504|GECCO|2005|Pricing the free lunch of meta-evolution|A number of recent studies introduced meta-evolutionary strategies and successfully used them for solving problems in genetic programming. While individual results indicate possibilities of successes and failures (e.g., Kantschik, Dittrich et al., , ), the emerging global picture suggests that the approach may have universal, domain-independent advantages over traditional methods. Trying to develop a general theoretical understanding of this concept, we use Price's theorem to define fitness at a meta-level and show with two simple case studies (two-dimensional optimization and the Eight puzzle) that the ideology based on Price's theorem can work at a meta-level in a similar manner for very different problems. Specifically, Pricean definition of fitness for reproductive operators appears to be practically useful and essential for performance and stability of a certain class of meta-evolutionary algorithms.|Alexei V. Samsonovich,Kenneth A. De Jong","57598|GECCO|2006|A comparative study of evolutionary optimization techniques in dynamic environments|Genetic Algorithms have widely been used for solving optimization problems in stationary environments. In recent years, there has been a growing interest for investigating and improving the performance of these algorithms in dynamic environments where the fitness landscape changes. In this study, we present an extensive comparison of several algorithms with different characteristics on a common platform by using the moving peaks benchmark and by varying problem parameters.|Demet Ayvaz,Haluk Topcuoglu,Fikret S. G√ºrgen"],["57706|GECCO|2006|On the local performance of simulated annealing and the  evolutionary algorithm|Simulated annealing and the (+) EA, a simple evolutionary algorithm, are both general randomized search heuristics that optimize any objective function with probability converging to . But they use very different techniques to achieve this global convergence. The (+) EA applies global mutations than can reach any point in the search space in one step together with an elitist selection mechanism. Simulated annealing restricts its search to a neighborhood but employs a randomized selection scheme where the probability for accepting a move to a new point in the search space depends on the difference in function values as well as on the current time step. Otherwise, the two algorithms are equal. It is known that the different philosophies of search implemented in the two heuristics can lead to exponential performance gaps between the two algorithms with respect to the expected optimization time. Even for very restricted classes of objective functions where the differences in function values between neighboring points are strictly limited the performance differences can be huge. Here, a more local point of view is taken. Considering obstacles in the fitness landscapes it is proven that the local performance of the two algorithms is remarkably similar in spite of their different search behaviors.|Thomas Jansen,Ingo Wegener","58086|GECCO|2007|A hybrid evolutionary programming algorithm for spread spectrum radar polyphase codes design|This paper presents a hybrid evolutionary programming algorithm to solve the spread spectrum radar polyphase code design problem. The proposed algorithm uses an Evolutionary Programming (EP) approach as global search heuristic. This EP is hybridized with a gradient-based local search procedure which includes a dynamic step adaptation procedure to perform accurate and efficient local search for better solutions. Numerical examples demonstrate that the algorithm outperforms existing approaches for this problem.|√?ngel M. P√©rez-Bellido,Sancho Salcedo-Sanz,Emilio G. Ort√≠z-Garc√≠a,Antonio Portilla-Figueras","58515|GECCO|2008|Parameter-less evolutionary search|The paper presents the parameter-less implementation of an evolutionary-based search. It does not need any predefined control parameters values, which are usually used for genetic algorithms and similar techniques. Efficiency of the proposed algorithm was evaluated by CEC benchmark functions and a real-world product optimization problem.|Gregor Papa","57921|GECCO|2007|A memetic algorithm for the low autocorrelation binary sequence problem|Finding binary sequences with low auto correlation is a very hard problem with many practical applications. In this paper we analyze several meta heuristic approaches to tackle the construction of this kind of sequences. We focus on two different local search strategies, steepest descent local search (SDLS) and tabu search (TS), and their use both as stand-alone techniques and embedded within a memetic algorithm (MA). Plain evolutionary algorithms are shown to perform worse than stand-alone local search strategies. However, a MA endowed with TS turns out to be a state-of-the-art algorithm it consistently finds optimal sequences in considerably less time than previous approaches reported in the literature.|Jos√© E. Gallardo,Carlos Cotta,Antonio J. Fern√°ndez","57533|GECCO|2005|Alternative implementations of the Griewangk function|The well-known Griewangk function, used for evaluation of evolutionary algorithms, becomes easier as the number of dimensions grows. This paper suggests three alternative implementations that maintain function complexity for high-dimensional versions of the problem. Diagonal slices of the search landscape and local search are used to demonstrate and evaluate the difficulty of each function.|Artem Sokolov,L. Darrell Whitley,Monte Lunacek","57510|GECCO|2005|Improving EA-based design space exploration by utilizing symbolic feasibility tests|This paper will propose a novel approach in combining Evolutionary Algorithms with symbolic techniques in order to improve the convergence of the algorithm in the presence of large search spaces containing only few feasible solutions. Such problems can be encountered in many real-world applications. Here, we will use the example of design space exploration of embedded systems to illustrate the benefits of our approach. The main idea is to integrate symbolic techniques into the Evolutionary Algorithm to guide the search towards the feasible region. We will present experimental results showing the advantages of our novel approach.|Thomas Schlichter,Christian Haubelt,J√ºrgen Teich","57671|GECCO|2006|Maximum cardinality matchings on trees by randomized local search|To understand the working principles of randomized search heuristics like evolutionary algorithms they are analyzed on optimization problems whose structure is well-studied. The idea is to investigate when it is possible to simulate clever optimization techniques for combinatorial optimization problems by random search. The maximum matching problem is well suited for this approach since long augmenting paths do not allow immediate improvements by local changes. It is known that randomized search heuristics like simulated annealing, the Metropolis algorithm, the (+) EA and randomized local search efficiently approximate maximum matchings for any graph however, there are graphs where they fail to find maximum matchings in polynomial time. In this paper, we examine randomized local search (RLS) for graphs whose structure is simple. We show that RLS finds maximum matchings on trees in expected polynomial time.|Oliver Giel,Ingo Wegener","57112|GECCO|2003|HEMO A Sustainable Multi-objective Evolutionary Optimization Framework|The capability of multi-objective evolutionary algorithms (MOEAs) to handle premature convergence is critically important when applied to real-world problems. Their highly multi-modal and discrete search space often makes the required performance out of reach to current MOEAs. Examining the fundamental cause of premature convergence in evolutionary search has led to proposing of a generic framework, named Hierarchical Fair Competition (HFC), for robust and sustainable evolutionary search. Here an HFC-based Hierarchical Evolutionary Multi-objective Optimization framework (HEMO) is proposed, which is characterized by its simultaneous maintenance of individuals of all degrees of evolution in hierarchically organized repositories, by its continuous inflow of random individuals at the base repository, by its intrinsic hierarchical elitism and hyper-grid-based density estimation. Two experiments demonstrate its search robustness and its capability to provide sustainable evolutionary search for difficult multi-modal problems. HEMO makes it possible to do reliable multi-objective search without risk of premature convergence. The paradigmatic transition of HEMO to handle premature convergence is that instead of trying to escape local optima from converged high fitness populations, it tries to maintain the opportunity for new optima to emerge from the bottom up as enabled by its hierarchical organization of individuals of different fitnesses.|Jianjun Hu,Kisung Seo,Zhun Fan,Ronald C. Rosenberg,Erik D. Goodman","57247|GECCO|2003|Quad Search and Hybrid Genetic Algorithms|A bit climber using a Gray encoding is guaranteed to converge to a global optimum in fewer than (L) evaluations on unimodal -D functions and on multi-dimensional sphere functions, where L bits are used to encode the function domain. Exploiting these ideas, we have constructed an algorithm we call Quad Search. Quad Search converges to a local optimum on unimodal -D functions in not more than L +  function evaluations. For unimodal -D and separable multi-dimensional functions, the result is the global optimum. We empirically assess the performance of steepest ascent local search, next ascent local search, and Quad Search. These algorithms are also compared with Evolutionary Strategies. Because of its rapid convergence time, we also use Quad Search to construct a hybrid genetic algorithm. The resulting algorithm is more effective than hybrid genetic algorithms using steepest ascent local search or the RBC next ascent local search algorithm.|L. Darrell Whitley,Deon Garrett,Jean-Paul Watson","59066|GECCO|2010|Incremental evolution of local search heuristics|In evolutionary computation, incremental evolution refers to the process of employing an evolutionary environment that becomes increasingly complex over time. We present an implementation of this approach to develop randomised local search heuristics for constraint satisfaction problems, combining research on incremental evolution with local search heuristics evolution. A population of local search heuristics is evolved using a genetic programming framework on a simple problem for a short period and is then allowed to evolve on a more complex problem. Experiments compare the performance of this population with that of a randomly initialised population evolving directly on the more complex problem. The results obtained show that incremental evolution can represent a significant improvement in terms of optimisation speed, solution quality and solution structure.|Dara Curran,Eugene C. Freuder,Thomas Jansen"],["58348|GECCO|2008|Greedy heuristics and evolutionary algorithms for the bounded minimum-label spanning tree problem|Given an edge-labeled, connected, undirected graph G and a bound r, the bounded minimum-label spanning tree problem seeks a spanning tree on G whose edges carry the fewest possible labels and in which no label appears more than r times. Two greedy heuristics for the unbounded version of the problem are adapted to the bounded version. Two genetic algorithms for the problem encode labeled spanning trees as permutations of G's edges. A simple GA performs poorly, but the addition of local search enables consistently good results.|Arindam Khaled,Bryant A. Julstrom","58174|GECCO|2007|On quality performance of heuristic and evolutionary algorithms for biobjective minimum spanning trees|In this paper, we consider a biobjective minimum spanning tree problem (MOST) and minimize two objectives - tree cost and diameter - in terms of Pareto-optimality. We assess the quality of obtained MOEA solutions in comparison to well-known diameter-constrained minimum spanning tree (dc-MST) algorithms and further improve MOEA solutions using problem-specific knowledge.|Rajeev Kumar,Pramod Kumar Singh","58677|GECCO|2009|Multiobjective genetic programming approach to evolving heuristics for the bounded diameter minimum spanning tree problem MOGP for BDMST|The bounded-diameter (or diameter-constrained) minimum spanning tree (BDMST) problem is a well-studied combinatorial optimization problem for which several heuristics such as one-time tree construction (OTTC), center based tree construction(CBTC), iterative refinement (IR) and randomized greedy heuristics (RGH) have been developed. Very little work, however, has been done on producing heuristics for BDMSTs using evolutionary algorithms. In this paper we have used multiobjective genetic programming (MOGP) to explore the evolution of a set of heuristics for the BDMST problem. The quality of the Pareto fronts obtained from the MOGP-evolved heuristics is comparable to, or in some cases better than, the Pareto fronts generated by established, hand-crafted heuristics. MOGP is thus a very promising technique for finding heuristics for BDMSTs and more general multiobjective combinatorial optimizations.|Rajeev Kumar,Bipul Kumar Bal,Peter Rockett","58327|GECCO|2008|The node-depth encoding analysis and application to the bounded-diameter minimum spanning tree problem|The node-depth encoding has elements from direct and indirect encoding for trees which encodes trees by storing the depth of nodes in a list. Node-depth encoding applies specific search operators that is a typical characteristic for direct encodings. An investigation into the bias of the initialization process and the mutation operators of the node-depth encoding shows that the initialization process has a bias to solutions with small depths and diameters, and a bias towards stars. This investigation, also, shows that the mutation operators are unbiased. The performance of node-depth encoding is investigated for the bounded-diameter minimum spanning tree problem. The results are presented for Euclidean instances presented in the literature. In contrast with the expectation, the evolutionary algorithm using the biased initialization operator does not allow evolutionary algorithms to find better solutions compared to an unbiased initialization. In comparison to other evolutionary algorithms for the bounded-diameter minimum spanning tree evolutionary algorithms using the node-depth encoding have a good performance.|Telma Woerle de Lima,Franz Rothlauf,Alexandre C. B. Delbem","58368|GECCO|2008|Orientation matters how to efficiently solve ocst problems with problem-specific EAs|The optimal communication spanning tree (OCST) problem is a well known $mathcalNP$-hard combinatorial optimization problem which seeks a spanning tree that satisfies all given communication requirements for minimal total costs. It has been shown that optimal solutions of OCST problems are biased towards the much simpler minimum spanning tree (MST) problem. Therefore, problem-specific representations for EAs like heuristic variants of edge-sets that are biased towards MSTs show high performance. In this paper, additional properties of optimal solutions for Euclidean variants of OCST problems are studied. Experimental results show that not only edges in optimal trees are biased towards low-distance weights but also edges which are directed towards the graph's center are overrepresented in optimal solutions. Therefore, efficient heuristic search algorithms for OCST should be biased towards edges with low distance weight emphand edges that point towards the center of the graph. Consequently, we extend the recombination operator of edge-sets such that the orientation of the edges is considered for constructing offspring solutions. Experimental results show a higher search performance in comparison to EAs using existing crossover strategies of edge-sets. As a result, we suggest to consider not only the distance weights but also the orientation of edges in heuristic solution approaches for the OCST problem.|Wolfgang Steitz,Franz Rothlauf","57771|GECCO|2006|An effective genetic algorithm for the minimum-label spanning tree problem|Given a connected, undirected graph G with labeled edges, the minimum label spanning tree problem seeks a spanning tree on G to whose edges are attached the smallest possible number of labels. A greedy heuristic for this NP-hard problem greedily chooses labels so as to reduce the number of components in the subgraphs they induce as quickly as possible. A genetic algorithm for the problem encodes candidate solutions as per mutations of the labels an initial segment of such a chromosome lists the labels that appear on the edges in the chromosome's tree. Three versions of the GA apply generic or heuristic crossover and mutation operators and a local search step. In tests on  randomly-generated instances of the minimum-label spanning tree problem, versions of the GA that apply generic operators, with and without the local search step, perform less well than the greedy heuristic, but a version that applies the local search step and operators tailored to the problem returns solutions that require on average  fewer labels than the heuristic's.|Jeremiah Nummela,Bryant A. Julstrom","58664|GECCO|2009|Exploiting hierarchical clustering for finding bounded diameter minimum spanning trees on euclidean instances|The bounded diameter minimum spanning tree problem is an NP-hard combinatorial optimization problem arising, for example, in network design when quality of service is of concern. There exist various exact and metaheuristic approaches addressing this problem, whereas fast construction heuristics are primarily based on Prim's minimum spanning tree algorithm and fail to produce reasonable solutions in particular on large Euclidean instances. A method based on hierarchical clustering to guide the construction process of a diameter constrained tree is presented. Solutions obtained are further refined using a greedy randomized adaptive search procedure. Based on the idea of clustering we also designed a new neighborhood search for this problem. Especially on large Euclidean instances with a tight diameter bound the results are excellent. In this case the solution quality can also compete with that of a leading metaheuristic, whereas the computation only needs a fraction of the time.|Martin Gruber,G√ºnther R. Raidl","57610|GECCO|2006|An ant-based algorithm for finding degree-constrained minimum spanning tree|A spanning tree of a graph such that each vertex in the tree has degree at most d is called a degree-constrained spanning tree. The problem of finding the degree-constrained spanning tree of minimum cost in an edge weighted graphis well known to be NP-hard. In this paper we give an Ant-Based algorithm for finding low cost degree-constrained spanning trees. Ants are used to identify a set of candidate edges from which a degree-constrained spanning tree can be constructed. Extensive experimental results show that the algorithm performs very well against other algorithms on a set of  problem instances.|Thang Nguyen Bui,Catherine M. Zrncic","58079|GECCO|2007|Evolutionary algorithms and matroid optimization problems|We analyze the performance of evolutionary algorithms on various matroid optimization problems that encompass a vast number of efficiently solvable as well as NP-hard combinatorial optimization problems (including many well-known examples such as minimum spanning tree and maximum bipartite matching). We obtain very promising bounds on the expected running time and quality of the computed solution. Our results establish a better theoretical understanding of why randomized search heuristics yield empirically good results for many real-world optimization problems.|Joachim Reichel,Martin Skutella","57390|GECCO|2005|The blob code is competitive with edge-sets in genetic algorithms for the minimum routing cost spanning tree problem|Among the many codings of spanning trees for evolutionary search are those based on bijections between Prfer strings---strings of n- vertex labels---and spanning trees on the labeled vertices. One of these bijections, called the Blob Code, showed promise as an evolutionary coding, but EAs that use it to represent spanning trees have not performed well. Here, a genetic algorithm that represents spanning trees via the Blob Code is faster than, and returns results competitive with those of, a GA that encodes spanning trees as edge-sets on Euclidean instances of the minimum routing cost spanning tree problem. On instances whose edge weights have been chosen at random, the Blob-coded GA maintains its time advantage, but its results are inferior to those of the edge-set-coded GA, and both GAs are hard pressed to keep up with a simple stochastic hill-climber on all the test instances.|Bryant A. Julstrom"],["57864|GECCO|2006|A GA-ACO-local search hybrid algorithm for solving quadratic assignment problem|In recent decades, many meta-heuristics, including genetic algorithm (GA), ant colony optimization (ACO) and various local search (LS) procedures have been developed for solving a variety of NP-hard combinatorial optimization problems. Depending on the complexity of the optimization problem, a meta-heuristic method that may have proven to be successful in the past might not work as well. Hence it is becoming a common practice to hybridize meta-heuristics and local heuristics with the aim of improving the overall performance. In this paper, we propose a novel adaptive GA-ACO-LS hybrid algorithm for solving quadratic assignment problem (QAP). Empirical study on a diverse set of QAP benchmark problems shows that the proposed adaptive GA-ACO-LS converges to good solutions efficiently. The results obtained were compared to the recent state-of-the-art algorithm for QAP, and our algorithm showed obvious improvement.|Yiliang Xu,Meng-Hiot Lim,Yew-Soon Ong,Jing Tang","59091|GECCO|2010|Ant colony optimization and the minimum cut problem|Ant Colony Optimization (ACO) is a powerful metaheuristic for solving combinatorial optimization problems. With this paper we contribute to the theoretical understanding of this kind of algorithm by investigating the classical minimum cut problem. An ACO algorithm similar to the one that was proved successful for the minimum spanning tree problem is studied. Using rigorous runtime analyses we show how the ACO algorithm behaves similarly to Karger and Stein's algorithm for the minimum cut problem as long as the use of pheromone values is limited. Hence optimal solutions are obtained in expected polynomial time. On the other hand, we show that high use of pheromones has a negative effect, and the ACO algorithm may get trapped in local optima resulting in an exponential runtime to obtain an optimal solution. This result indicates that ACO algorithms may be inappropriate for finding minimum cuts.|Timo K√∂tzing,Per Kristian Lehre,Frank Neumann,Pietro Simone Oliveto","57352|GECCO|2005|Ant colony optimization for power plant maintenance scheduling optimization|In order to maintain a reliable and economic electric power supply, the maintenance of power plants is becoming increasingly important. In this paper, a formulation that enables ant colony optimization (ACO) algorithms to be applied to the power plant maintenance scheduling optimization (PPMSO) problem is developed and tested on a -unit case study. A heuristic formulation is introduced and its effectiveness in solving the problem is investigated. The performance of two different ACO algorithms is compared, including Best Ant System (BAS) and Max-Min Ant System (MMAS), and a detailed sensitivity analysis is conducted on the parameters controlling the searching behavior of ACO algorithms. The results obtained indicate that the performance of the two ACO algorithms investigated is significantly better than that of a number of other metaheuristics, such as genetic algorithms and simulated annealing, which have been applied to the same case study previously. In addition, use of the heuristics significantly improves algorithm performance. Also, ACO is found to have similar performance for the case study considered across an identified range of parameter values.|Wai-Kuan Foong,Holger R. Maier,Angus R. Simpson","57042|GECCO|2003|Ant-Based Crossover for Permutation Problems|Crossover for evolutionary algorithms applied to permutation problems is a difficult and widely discussed topic. In this paper we use ideas from ant colony optimization to design a new permutation crossover operator. One of the advantages of the new crossover operator is the ease to introduce problem specific heuristic knowledge. Empirical tests on a travelling salesperson problem show that the new crossover operator yields excellent results and significantly outperforms evolutionary algorithms with edge recombination operator as well as pure ant colony optimization.|J√ºrgen Branke,Christiane Barz,Ivesa Behrens","58943|GECCO|2010|An ant colony optimization approach to the multiple-choice multidimensional knapsack problem|In this paper, we present an ant colony optimization (ACO) approach to solve the multiple-choice multidimensional knapsack problem (MMKP). This problem concerns many real life problems, and is hard to solve due to its strong constraints and NP-hard property. The ACO approach given in this paper follows the algorithmic scheme of max-min ant system, but has some new features with respect to the characteristics of the MMKP. First, a single-group-oriented solution construction method is proposed, which allows ants to generate solutions efficiently. Second, some Lagrangian dual information obtained from a Lagrangian relaxation of MMKP is integrated into ACO. In addition, we develop a novel repair operator, with which the possible infeasible solutions generated by ants can be fixed. The proposed approach has been tested on a number of MMKP instances. Computational results show that it is able to produce competitive solutions in comparison with existing algorithms.|Zhigang Ren,Zuren Feng","58655|GECCO|2009|Evolving an edge selection formula for ant colony optimization|This project utilizes the evolutionary process found in Genetic Programming to evolve an improved decision formula for the Ant System algorithm. Two such improved formulae are discovered, one which uses the typical roulette wheel selection found in all well-known Ant Colony Optimization algorithms, and one which uses a greedy-style selection mechanism. The evolution of each formula is trained using the Ant System algorithm to solve a small Travelling Salesman Problem (TSP) and tested using larger unseen TSP instances.|Andrew Runka","58522|GECCO|2008|A multi-objective ant colony approach for pareto-optimization using dynamic programming|This paper covers a multi-objective Ant Colony Optimization, which is applied to the NP-complete multi-objective shortest path problem in order to approximate Pareto-fronts. The efficient single-objective solvability of the problem is used to improve the results of the ant algorithm significantly. A dynamic program is developed which generates local heuristic values on the edges of the problem graph. These heuristic values are used by the artificial ants.|Sascha H√§ckel,Marco Fischer,David Zechel,Tobias Teich","58312|GECCO|2008|Scaling ant colony optimization with hierarchical reinforcement learning partitioning|This paper merges hierarchical reinforcement learning (HRL) with ant colony optimization (ACO) to produce a HRL ACO algorithm capable of generating solutions for large domains. This paper describes two specific implementations of the new algorithm the first a modification to Dietterich's MAXQ-Q HRL algorithm, the second a hierarchical ant colony system algorithm. These implementations generate faster results, with little to no significant change in the quality of solutions for the tested problem domains. The application of ACO to the MAXQ-Q algorithm replaces the reinforcement learning, Q-learning, with the modified ant colony optimization method, Ant-Q. This algorithm, MAXQ-AntQ, converges to solutions not significantly different from MAXQ-Q in % of the time. This paper then transfers HRL techniques to the ACO domain and traveling salesman problem (TSP). To apply HRL to ACO, a hierarchy must be created for the TSP. A data clustering algorithm creates these subtasks, with an ACO algorithm to solve the individual and complete problems. This paper tests two clustering algorithms, k-means and G-means. The results demonstrate the algorithm with data clustering produces solutions  times faster with -% decrease in solution quality due to the effects of clustering.|Erik J. Dries,Gilbert L. Peterson","58901|GECCO|2010|A few ants are enough ACO with iteration-best update|Ant colony optimization (ACO) has found many applications in different problem domains. We carry out a first rigorous runtime analysis of ACO with iteration-best update, where the best solution in the each iteration is reinforced. This is similar to comma selection in evolutionary algorithms. We compare ACO to evolutionary algorithms for which it is well known that an offspring size of (log n), n the problem dimension, is necessary to optimize even simple functions like ONEMAX. In sharp contrast, ACO is efficient on ONEMAX even for the smallest possible number of two ants. Remarkably, this only holds if the pheromone evaporation rate is small enough the collective memory of many ants stored in the pheromones makes up for the small number of ants. We further prove an exponential lower bound for ACO with iteration-best update that depends on a trade-off between the number of ants and the evaporation rate.|Frank Neumann,Dirk Sudholt,Carsten Witt","57245|GECCO|2003|Revisiting Elitism in Ant Colony Optimization|Ant Colony Optimization (ACO) has been applied successfully in solving the Traveling Salesman Problem. Marco Dorigo et al. used Ant System (AS) to explore the Symmetric Traveling Salesman Problem and found that the use of a small number of elitist ants can improve algorithm performance. The elitist ants take advantage of global knowledge of the best tour found to date and reinforce this tour with pheromone in order to focus future searches more effectively. This paper discusses an alternative approach where only local information is used to reinforce good tours thereby enhancing the ability of the algorithm for multiprocessor or actual network implementation. In the model proposed, the ants are endowed with a memory of their best tour to date. The ants then reinforce this \"local best tour\" with pheromone during an iteration to mimic the search focusing of the elitist ants. The environment used to simulate this model is described and compared with Ant System.|Tony White,Simon Kaegi,Terri Oda"],["57029|GECCO|2003|Structural and Functional Sequence Test of Dynamic and State-Based Software with Evolutionary Algorithms|Evolutionary Testing (ET) has been shown to be very successful for testing real world applications . The original ET approach focuses on searching for a high coverage of the test object by generating separate inputs for single function calls. We have identified a large set of real world application for which this approach does not perform well because only sequential calls of the tested function can reach a high structural coverage (white box test) or can check functional behavior (black box tests). Especially, control software which is responsible for controlling and constraining a system cannot be tested successfully with ET. Such software is characterized by storing internal data during a sequence of calls. In this paper we present the Evolutionary Sequence Testing approach for white box and black box tests. For automatic sequence testing, a fitness function for the application of ET will be introduced, which allows the optimization of input sequences that reach a high coverage of the software under test. The authors also present a new compact description for the generation of real-world input sequences for functional testing. A set of objective functions to evaluate the test output of systems under test have been developed. These approaches are currently used for the structural and safety testing of car control systems.|Andr√© Baresel,Hartmut Pohlheim,Sadegh Sadeghipour","59003|GECCO|2010|Evolutionary algorithms in large-scale open pit mine scheduling|With many years of research and application to real-world problems, evolutionary algorithms (EAs) have solved various problems having thousands of variables, hard heuristic constraints, and complex evaluation procedures. This paper reports another successful application of EAs in open pit mine scheduling. Typically an ore body is discretized as a D block model which, depending on factors such as the amount of data obtained, size of deposit, block dimensions etc. can be made up of over one million blocks, thereby requiring an optimization algorithm to handle over a million variables. Open pit mine scheduling is a complex task which is subject to very strict hard geometrical and other practical mining constraints. To the best of our knowledge there are currently no algorithm or software package that can cater for the large number of constraints and sheer scale of the data sets represented by open pit mine scheduling. Most packages are limited in the size of block model and the kind of objective and constraint functions they can efficiently handle. The proposed optimization algorithm and the resulting software (evORElution -- a trademark product of ORElogy) is developed by using the theoretical and fundamental results of evolutionary algorithms and has already been successfully used to produce complex multi-objective schedules for several large open pit iron ore mines involving hundreds of thousands to millions of variables.|Christie Myburgh,Kalyanmoy Deb","57459|GECCO|2005|Morphing methods in evolutionary design optimization|Design optimization is a well established application field of evolutionary computation. However, standard recombination operators acting on the genotypic representation of the design or shape are often too disruptive to be useful during optimization. In this work, we will analyze whether morphing methods between two shapes can be used as recombination operators acting on the phenotype space, thus directly on the shape or design. We introduce three different morphing methods and employ them as recombination operators in a standard evolution strategy (es). We compare their performance with an evolution strategy without any recombination operators on two target shape approximation problem. We can conclude that two of the three morphing methods can be useful during search although all morphing methods still turn out to hinder the self-adaptation of the step sizes of the evolution strategy.|Michael Nashvili,Markus Olhofer,Bernhard Sendhoff","58422|GECCO|2008|Application domain study of evolutionary algorithms in optimization problems|This paper deals with the problem of comparing and testing evolutionary algorithms, that is, the benchmarking problem, from an analysis point of view. A practical study of the application domain of four representative evolutionary algorithms is carried out using a relevant set of real-parameter function optimization benchmarks. The four selected algorithms are the Covariance Matrix Adaptation Evolution Strategy (CMA-ES) and the Differential Evolution (DE), due to their successful results in recent studies, a Genetic Algorithm with real parameter operators, used here as a reference approach because it is probably the most familiar to researchers, and the Macroevolutionary algorithm (MA), which is not widely known but it shows a very remarkable behavior in some problems. The algorithms have been compared running several tests over the benchmark function set to analyze their capabilities from a practical point of view, in other words, in terms of their usability. The characterization of the algorithms is based on accuracy, stability and time consumption parameters thus establishing their operational scope and the type of optimization problems they are more suitable for.|Pilar Caama√±o,Francisco Bellas,Jos√© Antonio Becerra,Richard J. Duro","57812|GECCO|2006|The complete-basis-functions parameterization in ES and its application to laser pulse shaping|This paper presents a new parameterization method for the Evolution Strategies (ES) field, and its application to a challenging real-life high-dimensional Physics optimization problem, namely Femtosecond Laser Pulse Shaping. The so-called Complete-Basis-Functions Parameterization method (CBFP), to be introduced here for the first time, is developed for tackling efficiently the given laser optimization task, but nevertheless is a general method that can be used for learning any n-variables functions. The emphasis is on dimensionality reduction of the search space and the speeding-up of the convergence process respectively. This is achieved by learning the target function by using complete-basis functions as building blocks in an evolutionary search. The method is shown to boost the learning process of the given laser problem, and to yield highly satisfying results.|Ofer M. Shir,Christian Siedschlag,Thomas B√§ck,Marc J. J. Vrakking","58595|GECCO|2009|An evolutionary approach to planning IEEE  networks|Efficient and effective deployment of IEEE . networks to service an area of users with certain traffic demands is an important network planning problem. We resort to an evolutionary approach in order to yield good approximation solutions. In our method, novel genetic variation operations are proposed to incorporate the feature of this real-world application of evolutionary algorithm.|Ting Hu,Yuanzhu Peter Chen,Wolfgang Banzhaf,Robert Benkoczi","57845|GECCO|2006|Heterogeneous cooperative coevolution strategies of integration between GP and GA|Cooperative coevolution has proven to be a promising technique for solving complex combinatorial optimization problems. In this paper, we present four different strategies which involve cooperative coevolution of a genetic program and of a population of constants evolved by a genetic algorithm. The genetic program evolves expressions that solve a problem, while the genetic algorithm provides \"good\" values for the numeric terminal symbols used by those expressions. Experiments have been performed on three symbolic regression problems and on a \"real-world\" biomedical application. Results are encouraging and confirm that our coevolutionary algorithms can be used effectively in different domains.|Leonardo Vanneschi,Giancarlo Mauri,Andrea Valsecchi,Stefano Cagnoni","57622|GECCO|2006|A novel approach to optimize clone refactoring activity|Software evolution and software quality are ever changing phenomena. As software evolves, evolution impacts software quality. On the other hand, software quality needs may drive software evolution strategies.This paper presents an approach to schedule quality improvement under constraints and priority. The general problem of scheduling quality improvement has been instantiated into the concrete problem of planning duplicated code removal in a geographical information system developed in C throughout the last  years. Priority and constraints arise from development team and from the adopted development process. The developer team long term goal is to get rid of duplicated code, improve software structure, decrease coupling, and improve cohesion.We present our problem formulation, the adopted approach, including a model of clone removal effort and preliminary results obtained on a real world application.|Salah Bouktif,Giuliano Antoniol,Ettore Merlo,Markus Neteler","58195|GECCO|2007|ICSPEA evolutionary five-axis milling path optimisation|ICSPEA is a novel multi-objective evolutionary algorithm which integrates aspects from the powerful variation operators of the Covariance Matrix Adaptation Evolution Strategy (CMA-ES) and the well proven multi-objective Strength Pareto Evaluation Scheme of the SPEA . The CMA-ES has already shown excellent performance on various kinds of complex single-objective problems. The evaluation scheme of the SPEA  selects individuals with respect to their current position in the objective space using a scalar index in order to form proper Pareto front approximations. These indices can be used by the CMA-part of ICSPEA for learning and guiding the search towards better Pareto front approximations. The ICSPEA is applied to complex benchmark functions such as an extended n-dimensional Schaffer's function or Quagliarella's problem. The results show that the CMA operator allows ICSPEA to find the Pareto set of the generalised Schaffer's function faster than SPEA . Furthermore, this concept is tested on the complex real-world application of the multi-objective optimization of five-axis milling NC-paths. An application of ICSPEA to the milling-path optimisation problem yielded efficient sets of five-axis NC-paths.|J√∂rn Mehnen,Rajkumar Roy,Petra Kersting,Tobias Wagner","59066|GECCO|2010|Incremental evolution of local search heuristics|In evolutionary computation, incremental evolution refers to the process of employing an evolutionary environment that becomes increasingly complex over time. We present an implementation of this approach to develop randomised local search heuristics for constraint satisfaction problems, combining research on incremental evolution with local search heuristics evolution. A population of local search heuristics is evolved using a genetic programming framework on a simple problem for a short period and is then allowed to evolve on a more complex problem. Experiments compare the performance of this population with that of a randomly initialised population evolving directly on the more complex problem. The results obtained show that incremental evolution can represent a significant improvement in terms of optimisation speed, solution quality and solution structure.|Dara Curran,Eugene C. Freuder,Thomas Jansen"],["57958|GECCO|2007|Dendritic cells for SYN scan detection|Artificial immune systems have previously been applied to the problem of intrusion detection. The aim of this research is to develop an intrusion detection system based on the function of Dendritic Cells (DCs). DCs are antigen presenting cells and key to the activation of the human immune system, behaviour which has been abstracted to form the Dendritic Cell Algorithm (DCA). In algorithmic terms, individual DCs perform multi-sensor data fusion, asynchronously correlating the fused data signals with a secondary data stream. Aggregate output of a population of cells is analysed and forms the basis of an anomaly detection system. In this paper the DCA is applied to the detection of outgoing port scans using TCP SYN packets. Results show that detection can be achieved with the DCA, yet some false positives can be encountered when simultaneously scanning and using other network services. Suggestions are made for using adaptive signals to alleviate this uncovered problem.|Julie Greensmith,Uwe Aickelin","58941|GECCO|2010|On the problems of using learning classifier systems for fraud detection|Fraud detection problems have some uniquely challenging properties which make them difficult. In this paper, we investigate the fraud detection problem by describing the common properties of electronic fraud and examining how learning classifier systems (LCSs) can be applied to it. Also, we introduce \"random Boolean function\" (RBF) an abstract problem with high level of controllability which can be tuned to exhibit those characteristics individually, and report the results of using XCSR (a continuous variant of LCS) on RBF problem and also on a real-world problem. Results from our experiments demonstrate that XCSR can overcome most of the difficulties inherent to the fraud detection problem and can achieve good performance in case of the real-world problem.|Mohammad Behdad,Tim French,Luigi Barone,Mohammed Bennamoun","58189|GECCO|2007|Extended thymus action for reducing false positives in ais based network intrusion detection systems|One of the major problems faced by anomaly based Network Intrusion Detection (NID) systems is the high number of false positives. False positives refer to the false detection of normal behavior as malicious behavior. Artificial Immune Systems (AISs) also fall under the category of anomaly based-NID systems. AIS presented in this paper is as a victim-end filter, consisting of detectors distributed on the network, which distinguishes normal traffic from malicious traffic. In this work, we focus on TCP-SYN flood based Distributed Denial of Services (DDoS) attacks. Light Weight Intrusion Detection System (LISYS) provides the basic framework for AIS based NID systems. AISs normally utilize the negative selection algorithm in thymus action to tolerize the detectors to normal traffic so they may not detect normal traffic as malicious traffic. We propose and implement extended thymus action' model to improve this characteristic of AIS. Results verify that our model significantly reduces false positives which is a major concern in anomaly-based NID systems.|M. Zubair Shafiq,Mehrin Kiani,Bisma Hashmi,Muddassar Farooq","57098|GECCO|2003|The Effect of Binary Matching Rules in Negative Selection|Negative selection algorithm is one of the most widely used techniques in the field of artificial immune systems. It is primarily used to detect changes in databehavior patterns by generating detectors in the complementary space (from given normal samples). The negative selection algorithm generally uses binary matching rules to generate detectors. The purpose of the paper is to show that the low-level representation of binary matching rules is unable to capture the structure of some problem spaces. The paper compares some of the binary matching rules reported in the literature and study how they behave in a simple two-dimensional real-valued space. In particular, we study the detection accuracy and the areas covered by sets of detectors generated using the negative selection algorithm.|Fabio A. Gonz√°lez,Dipankar Dasgupta,Jonatan G√≥mez","58720|GECCO|2009|IMAD in-execution malware analysis and detection|The sophistication of computer malware is becoming a serious threat to the information technology infrastructure, which is the backbone of modern e-commerce systems. We, therefore, advocate the need for developing sophisticated, efficient, and accurate malware classification techniques that can detect a malware on the first day of its launch -- commonly known as \"zero-day malware detection\". To this end, we present a new technique, IMAD, that can not only identify zero-day malware without any apriori knowledge but can also detect a malicious process while it is executing (in-execution detection). The capability of in-execution malware detection empowers an operating system to immediately kill it before it can cause any significant damage. IMAD is a realtime, dynamic, efficient, in-execution zero-day malware detection scheme, which analyzes the system call sequence of a process to classify it as malicious or benign. We use Genetic Algorithm to optimize system parameters of our scheme. The evolutionary algorithm is evaluated on real world synthetic data extracted from a Linux system. The results of our experiments show that IMAD achieves more than % accuracy in classifying in-execution processes as benign or malicious. Moreover, our scheme can classify approximately % of malicious processes within first % of their system calls.|Syed Bilal Mehdi,Ajay Kumar Tanwani,Muddassar Farooq","57778|GECCO|2006|Immune anomaly detection enhanced with evolutionary paradigms|The paper presents an approach based on principles of immune systems to the anomaly detection problem. Flexibility and efficiency of the anomaly detection system are achieved by building a model of network behavior based on the self-nonself space paradigm. Covering both self and nonself spaces by hyperrectangular structures is proposed. Structures corresponding to self-space are built using a training set from this space. Hyperrectangular detectors covering nonself space are created using niching genetic algorithm. A coevolutionary algorithm is proposed to enhance this process. Results of experiments show a high quality of intrusion detection, which outperform the quality of recently proposed approach based on hypersphere representation of self-space.|Marek Ostaszewski,Franciszek Seredynski,Pascal Bouvry","58266|GECCO|2008|A sense of danger dendritic cells inspired artificial immune system for manet security|AIS-based intrusion detection systems classically utilize the paradigm of selfnon-self discrimination. In this approach, an algorithm learns self during a learning phase, therefore, such algorithms do not have the ability to cope with scenarios in which self is continuously changing with time. This situation is encountered once malicious nodes are to be detected in a Mobile Ad Hoc Network (MANET). Consequently, it becomes a challenge to differentiate a valid route change due to mobility from an illegal one due to tampering of routing information by malicious nodes. In this paper, we propose a dendritic cell based distributed misbehavior detection system, BeeAIS-DC, for a BioNature inspired MANET routing protocol, BeeAdHoc. Our proposed system inspires from the danger theory and models the function and behavior of dendritic cells to detect the presence or absence of danger and provides a tolerogenic or immunogenic response. The proposed detection system is implemented in a well-known ns- simulator. Our results indicate that our detection system not only enables BeeAIS-DC to dynamically adapt its detector set to cater for a changing self due to mobility of nodes, but also is robust enough to provide significantly smaller false positives as compared to selfnon-self based AIS. Moreover, the danger theory related overhead of BeeAIS-DC is minimal, and as a result, it does not degrade traditional performance metrics of BeeAdHoc. This behavior is vital for batterybandwidth constrained mobile nodes.|Nauman Mazhar,Muddassar Farooq","58017|GECCO|2007|Procreating V-detectors for nonself recognition an application to anomaly detection in power systems|The artificial immune system approach for self-nonself discrimination and its application to anomaly detection problems in engineering is showing great promise. A seminal contribution in this area is the V-detectors algorithm that can very effectively cover the nonself region of the feature space with a set of detectors. The detector set can be used to detect anomalous inputs. In this paper, a multistage approach to create an effective set of V-detectors is considered. The first stage of the algorithm generates an initial set of V-detectors. In subsequent stage, new detectors are grown from existing ones, by means of a mechanism called procreation. Procreating detectors can more effectively fill hard-to-reach interstices in the nonself region, resulting in better coverage. The effectiveness of the algorithm is first illustrated by applying it to a well-known fractal, the Koch curve. The algorithm is then applied to the problem of detecting anomalous behavior in power distribution systems, and can be of much use for maintenance-related decision-making in electrical utility companies.|Min Gui,Sanjoy Das,Anil Pahwa","58069|GECCO|2007|SwarmArchitect a swarm framework for collaborative construction|Computer game development has become increasingly popular in the field of autonomous systems. One of the main topics studies the building of various architectures in computer games. A realistic human-like architecture is expected in a thematic computer game, since it strongly motivates the game players in an intuitive way. However, the task of building a human-like architecture is non-trivial since the construction is a real time process without human supervision. In this paper, we present a collective building algorithm inspired by social insects for intelligent construction based on multiple agents. A swarm of virtual agents indirectly design edifications, which resemble basic features in human-like architecture by using a stigmergic mechanism along with branching rules. The main idea of the algorithm is to map sensory information to appropriate building actions.|Yifeng Zeng,Jorge Cordero Hernandez,Dennis Plougman Buus","57781|GECCO|2006|An open-set speaker identification system using genetic learning classifier system|This paper presents the design and implementation of an adaptive open-set speaker identification system with genetic learning classifier systems. One of the challenging problems in using learning classifier systems for numerical problems is the knowledge representation. The voice samples are a series of real numbers that must be encoded in a classifier format. We investigate several different methods for representing voice samples for classifier systems and study the efficacy of the methods. We also identify several challenges for learning classifier systems in the speaker identification problem and introduce new methods to improve the learning and classification abilities of the systems. Experimental results show that our system successfully learns  voice features at the accuracies of % to %, which is considered a strong result in the speaker identification community. This research presents the feasibility of using learning classifier systems for the speaker identification problem.|WonKyung Park,Jae C. Oh,Misty K. Blowers,Matt B. Wolf"],["57266|GECCO|2005|Goal-oriented preservation of essential genetic information by offspring selection|This contribution proposes an enhanced and generic selection model for Genetic Algorithms (GAs) and Genetic Programming (GP) which is able to preserve the alleles which are part of a high quality solution. Some selected aspects of these enhanced techniques are discussed exemplarily on the basis of standardized benchmark problems.|Michael Affenzeller,Stefan Wagner 0002,Stephan M. Winkler","58651|GECCO|2009|Centric selection a way to tune the explorationexploitation trade-off|In this paper, we study the exploration  exploitation trade-off in cellular genetic algorithms. We define a new selection scheme, the centric selection, which is tunable and allows controlling the selective pressure with a single parameter. The equilibrium model is used to study the influence of the centric selection on the selective pressure and a new model which takes into account problem dependent statistics and selective pressure in order to deal with the exploration  exploitation trade-off is proposed the punctuated equilibria model. Performances on the quadratic assignment problem and NK-Landscapes put in evidence an optimal exploration  exploitation trade-off on both of the classes of problems. The punctuated equilibria model is used to explain these results.|David Simoncini,S√©bastien V√©rel,Philippe Collard,Manuel Clergue","59015|GECCO|2010|Why recombination should be adaptive|Crossover is the most complicated of the standard genetic operators as well as one of the main operators in genetic algorithms. The role of the crossover operator has not been satisfactorily explained. It has not been easy to show if it is essential for the construction and exploitation of building blocks during evolution. In this paper we introduce an adaptive crossover operator for two test functions. The results show that there is a clear increase in the rate of evolution when information on the state of the population is used to select the crossover point, compared to random selection of the crossover point.|Patricia Ortegon-Cano,Diego A. Hartasanchez,Christopher R. Stephens","58021|GECCO|2007|GARS an improved genetic algorithm with reserve selection for global optimization|This paper investigates how genetic algorithms (GAs) can be improved to solve large-scale and complex problems more efficiently. First of all, we review premature convergence, one of the challenges confronted with when applying GAs to real-world problems. Next, some of the methods now available to prevent premature convergence and their intrinsic defects are discussed. A qualitative analysis is then done on the cause of premature convergence that is the loss of building blocks hosted in less-fit individuals during the course of evolution. Thus, we propose a new improver - GAs with Reserve Selection (GARS), where a reserved area is set up to save potential building blocks and a selection mechanism based on individual uniqueness is employed to activate the potentials. Finally, case studies are done in a few standard problems well known in the literature, where the experimental results demonstrate the effectiveness and robustness of GARS in suppressing premature convergence, and also an enhancement is found in global optimization capacity.|Yang Chen,Jinglu Hu,Kotaro Hirasawa,Songnian Yu","57027|GECCO|2003|Real-Parameter Genetic Algorithms for Finding Multiple Optimal Solutions in Multi-modal Optimization|The aim of this paper is to identify Genetic Algorithms (GAs) which perform well over a range of continuous and smooth multimodal real-variable functions. In our study, we focus on testing GAs combining three classes of genetic operators selection, crossover and replacement. The approach followed is time-constrained and thus our stopping criterion is a fixed number of generations. Results show that GAs with random selection of parents and crowding replacement are robust optimizers. By contrast, GAs with tournament selection of parents and random replacement perform poorly in comparison.|Pedro J. Ballester,Jonathan N. Carter","57115|GECCO|2003|Using an Immune System Model to Explore Mate Selection in Genetic Algorithms|When Genetic Algorithms (GAs) are employed in multimodal function optimization, engineering and machine learning, identifying multiple peaks and maintaining subpopulations of the search space are two central themes. In this paper, an immune system model is adopted to develop a framework for exploring the role of mate selection in GAs with respect to these two issues. The experimental results reported in the paper will shed more light into how mate selection schemes compare to traditional selection schemes. In particular, we show that dissimilar mating is beneficial in identifying multiple peaks, yet harmful in maintaining subpopulations of the search space.|Chien-Feng Huang","58204|GECCO|2007|Population sizing for entropy-based model building in discrete estimation of distribution algorithms|This paper proposes a population-sizing model for entropy-based model building in discrete estimation of distribution algorithms. Specifically, the population size required for building an accurate model is investigated. The effect of selection pressure on population sizing is also preliminarily incorporated. The proposed model indicates that the population size required for building an accurate model scales as (m log m), where m is the number of substructures of the given problem and is proportional to the problem size. Experiments are conducted to verify the derivations, and the results agree with the proposed model.|Tian-Li Yu,Kumara Sastry,David E. Goldberg,Martin Pelikan","57991|GECCO|2007|A building-block royal road where crossover is provably essential|One of the most controversial yet enduring hypotheses about what genetic algorithms (GAs) are good for concerns the idea that GAs process building-blocks. More specifically, it has been suggested that crossover in GAs can assemble short low-order schemata of above average fitness (building blocks) to create higher-order higher-fitness schemata. However, there has been considerable difficulty in demonstrating this rigorously and intuitively. Here we provide a simple building-block function that a GA with two-point crossover can solve on average in polynomial time, whereas an asexual population or mutation hill-climber cannot.|Richard A. Watson,Thomas Jansen","58670|GECCO|2009|Three interconnected parameters for genetic algorithms|When an optimization problem is encoded using genetic algorithms, one must address issues of population size, crossover and mutation operators and probabilities, stopping criteria, selection operator and pressure, and fitness function to be used in order to solve the problem. This paper tests a relationship between () crossover probability, () mutation probability, and () selection pressure using two problems. This relationship is based on the schema theorem proposed by Holland and reflects the fact that the choice of parameters and operators for genetic algorithms needs to be problem specific.|Pedro A. Diaz-Gomez,Dean F. Hougen","57423|GECCO|2005|ARGEN  AREPO mixing the artificial genetic engineering and artificial evolution of populations to improve the search process|In this paper we analyze the performance of several evolutionary algorithms in the feature and instance selection problem. It is also introduced the ARGEN + AREPO search algorithm which has been tested in the same problem. There is no need to adapt parameters in this genetic algorithm, except the population size. The reported preliminary results show that using this technique in a wrapper model to search data subsets, we can obtain accuracy similar to the obtained with some of the genetic algorithms models here presented, but with less data.|Agust√≠n Le√≥n-Barranco,Sandra E. Barajas,Carlos A. Reyes Garc√≠a"],["59094|GECCO|2010|Knowledge mining with genetic programming methods for variable selection in flavor design|This paper presents a novel approach for knowledge mining from a sparse and repeated measures dataset. Genetic programming based symbolic regression is employed to generate multiple models that provide alternate explanations of the data. This set of models, called an ensemble, is generated for each of the repeated measures separately. These multiple ensembles are then utilized to generate information about, (a) which variables are important in each ensemble, (b) cluster the ensembles into different groups that have similar variables that drive their response variable, and (c) measure sensitivity of response with respect to the important variables. We apply our methodology to a sensory science dataset. The data contains hedonic evaluations (liking scores), assigned by a diverse set of human testers, for a small set of flavors composed from seven ingredients. Our approach () identifies the important ingredients that drive the liking score of a panelist and () segments the panelists into groups that are driven by the same ingredient, and () enables flavor scientists to perform the sensitivity analysis of liking scores relative to changes in the levels of important ingredients.|Katya Vladislavleva,Kalyan Veeramachaneni,Matt Burland,Jason Parcon,Una-May O'Reilly","58305|GECCO|2008|A GP algorithm for efficient synthesis of GM-C filters on a hexagonal FPAA structure|This work presents an approach based on Genetic Programming for the synthesis of continuous-time analog filters on a field-programmable analog array. A multi-objective algorithm is used to synthesize both the topology and parameter values of Gm-C filter structures to be instantiated on the FPAA based on a given filter specification. The presented algorithm is highly adapted to the underlying hardware platform, with the goal of making an efficient crossover of high-quality building blocks possible without biasing certain types of schemata. By manipulating of the program tree in the instantiation phase, it is assured that the resulting synthesized structure fits within the physical constraints of the underlying hardware platform.|Stanis Trendelenburg,Joachim Becker,Fabian Henrici,Yiannos Manoli","57948|GECCO|2007|Automated trading on financial instruments with evolved neural networks|This paper presents an approach to single-position, intraday automated trading based on a neuro-genetic algorithm.An artificial neural network is evolved which provides trading signals to a very unsophisticated automated trading agent.|Antonia Azzini,Andrea Tettamanzi","58607|GECCO|2009|An evolutionary approach to constructive induction for link discovery|This paper presents a genetic programming-based symbolic regression approach to the construction of relational features in link analysis applications. Specifically, we consider the problems of predicting, classifying and annotating friends relations in friends networks, based upon features constructed from network structure and user profile data. We first document a data model for the blog service LiveJournal, and define a set of machine learning problems such as predicting existing links and estimating inter-pair distance. Next, we explain how the problem of classifying a user pair in a social network, as directly connected or not, poses the problem of selecting and constructing relevant features. We use genetic programming to construct features, represented by multiple symbol trees with base features as their leaves. In this manner, the genetic program selects and constructs features that may not have been originally considered, but possess better predictive properties than the base features. Finally, we present classification results and compare these results with those of the control and similar approaches.|Tim Weninger,William H. Hsu,Jing Xia,Waleed Aljandal","58638|GECCO|2009|Data-intensive computing for competent genetic algorithms a pilot study using meandre|Data-intensive computing has positioned itself as a valuable programming paradigm to efficiently approach problems requiring processing very large volumes of data. This paper presents a pilot study about how to apply the data-intensive computing paradigm to evolutionary computation algorithms. Two representative cases (selectorecombinative genetic algorithms and estimation of distribution algorithms) are presented, analyzed, and discussed. This study shows that equivalent data-intensive computing evolutionary computation algorithms can be easily developed, providing robust and scalable algorithms for the multicore-computing era. Experimental results show how such algorithms scale with the number of available cores without further modification.|Xavier Llor√†","57375|GECCO|2005|Applying both positive and negative selection to supervised learning for anomaly detection|This paper presents a novel approach of applying both positive selection and negative selection to supervised learning for anomaly detection. It first learns the patterns of the normal class via co-evolutionary genetic algorithm, which is inspired from the positive selection, and then generates synthetic samples of the anomaly class, which is based on the negative selection in the immune system. Two algorithms about synthetic generation of the anomaly class are proposed. One deals with data sets containing a few anomalous samples while the other deals with data sets containing no anomalous samples at all. The experimental results on some benchmark data sets from UCI data set repertory show that the detection rate is improved evidently, accompanied by a slight increase in false alarm rate via introducing novel synthetic samples of the anomaly class. The advantages of our method are the increased ability of classifiers in identifying both previously known and innovative anomalies, and the maximal degradation of overfitting phenomenon.|Xiaoshu Hang,Honghua Dai","57789|GECCO|2006|Optimising cancer chemotherapy using an estimation of distribution algorithm and genetic algorithms|This paper presents a methodology for using heuristic search methods to optimise cancer chemotherapy. Specifically, two evolutionary algorithms - Population Based Incremental Learning (PBIL), which is an Estimation of Distribution Algorithm (EDA), and Genetic Algorithms (GAs) have been applied to the problem of finding effective chemotherapeutic treatments. To our knowledge, EDAs have been applied to fewer real world problems compared to GAs, and the aim of the present paper is to expand the application domain of this technique.We compare and analyse the performance of both algorithms and draw a conclusion as to which approach to cancer chemotherapy optimisation is more efficient and helpful in the decision-making activity led by the oncologists.|Andrei Petrovski,Siddhartha Shakya,John A. W. McCall","58818|GECCO|2009|Optimal designs of ambiguous mobile keypad with alphabetical constraints|We address the problem of finding multitap-based optimal keypad designs. This paper presents novel alphabetically-constrained keypad designs, which are optimized on real-world SMS message data by dynamic programming and genetic algorithms. When compared with traditional designs, the proposed ones improved them by about  to  percent.|Hyumin Kim,Yong-Hyuk Kim","59010|GECCO|2010|A hybrid genetic algorithm for automatic graph drawing based on the topology-shape-metric approach|This paper presents a new approach for automatic graph drawing based on Genetic algorithms. The classical topology-shape-metric approach for orthogonal graph drawing keeps a fixed planar embedding obtained in its first step (planarization), using it for the next two steps (orthogonalization and compaction). However, each step is itself an NP-hard problem, and the choices made and heuristics used on previous stages have a direct impact on subsequent ones. We can, alternatively, obtain a large number of planar embeddings by varying the order of insertion of the graph's edges when constructing such embeddings. Following that, the genetic algorithm is applied to select the planar embeddings that would lead to the final best drawing, after evaluating its performance on the subsequent orthogonalization and compaction steps. We formulate the problem of finding an optimal planar embedding for the graph as a permutation-based combinatorial optimization problem. The problem is then solved with the genetic algorithm, using appropriate selection, crossover and mutation operators, which were adapted from other permutation-based optimization problems, such as scheduling problems. The results show that our approach is able to find better solutions, representing improved final graph drawings than the ones found via the classical topology-shape-metric approach.|Bernadete Maria de Mendon√ßa Neta,Gustavo Henrique Diniz Araujo,Frederico Gadelha Guimar√£es,Renato Cardoso Mesquita","59007|GECCO|2010|Coevolutionary multi-population genetic programming for data classification|This work presents a new evolutionary ensemble method for data classification, which is inspired by the concepts of bagging and boosting, and aims at combining their good features while avoiding their weaknesses. The approach is based on a distributed multiple-population genetic programming (GP) algorithm which exploits the technique of coevolution at two levels. On the inter-population level the populations cooperate in a semi-isolated fashion, whereas on the intra-population level the candidate classifiers coevolve competitively with the training data samples. The final classifier is a voting committee composed by the best members of all the populations. The experiments performed in a varying number of populations show that our approach outperforms both bagging and boosting for a number of benchmark problems.|Douglas Adriano Augusto,Helio Jos√© Corr√™a Barbosa,Nelson Francisco Favilla Ebecken"]]},"title":{"entropy":5.582639096105901,"topics":["estimation distribution, neural networks, differential evolution, classifier systems, for learning, evolution strategies, learning classifier, artificial immune, building blocks, evolution for, immune systems, learning systems, evolution, series forecasting, evolution and, time series, systems using, for networks, learning, model for","algorithm for, evolutionary algorithm, evolutionary for, genetic algorithm, for optimization, genetic for, ant colony, for problem, algorithm optimization, algorithm with, evolutionary computation, multi-objective optimization, optimization using, evolutionary optimization, multiobjective optimization, hybrid algorithm, for multi-objective, multi-objective evolutionary, using algorithm, multi-objective algorithm","particle swarm, the problem, for the, algorithm the, the, particle optimization, the and, for problem, swarm optimization, and problem, the optimization, algorithm problem, the effects, the evolutionary, spanning tree, dynamic environments, genetic problem, minimum spanning, crossover for, analysis the","genetic programming, genetic algorithm, using genetic, genetic for, and genetic, using programming, genetic with, programming for, the genetic, and programming, using algorithm, using and, the using, search space, with programming, cellular automata, the programming, and algorithm, and for, selection and","estimation distribution, building blocks, distribution algorithm, estimation algorithm, model building, analysis for, with distribution, estimation with, analysis and, for building, distribution and, the distribution, estimation and, dendritic cell, combining and, for linkage, estimation for, analysis networks, algorithm for, algorithm with","model for, for gene, regulatory networks, systems model, using gene, gene expression, using data, evolving for, gene regulatory, using model, model and, gene networks, gene and, classification with, data classification, evolving networks, for classification, model, markov model, for structure","for multi-objective, multi-objective algorithm, solving problem, genetic for, using multi-objective, for planning, job shop, for problem, for classification, for solving, and flexible, with for, shop scheduling, data mining, multi-objective with, multi-objective problem, flexible scheduling, and job, genetic problem, constraint satisfaction","evolutionary algorithm, evolutionary for, evolutionary computation, using evolutionary, evolutionary and, multi-objective evolutionary, evolutionary with, the evolutionary, evolutionary problem, evolutionary approach, approach for, evolutionary design, for testing, for design, evolutionary testing, solve problem, evolutionary systems, algorithm for, evolutionary dynamic, evolutionary multiobjective","for problem, for tree, spanning tree, the tree, minimum spanning, algorithm for, for the, for spanning, minimum tree, the spanning, tree problem, genetic algorithm, for minimum, algorithm tree, spanning problem, for graph, the minimum, and tree, the graph, genetic for","crossover for, operator for, the crossover, crossover and, and mutation, for routing, mutation for, operator the, for the, the routing, crossover operator, probabilistic model, and operator, the structure, crossover problem, routing problem, the mutation, algorithm for, for problem, operator genetic","using genetic, using algorithm, the using, using and, genetic algorithm, cellular automata, for using, using, cellular algorithm, cooperative coevolution, using evolutionary, and development, cellular for, optimizing genetic, cellular genetic, image genetic, image using, genetic evolve, algorithm automata, using programming","genetic programming, genetic algorithm, genetic for, and genetic, using genetic, using programming, programming for, and programming, genetic with, the genetic, the programming, with programming, cartesian programming, genetic selection, cartesian genetic, stock markets, rule genetic, linear genetic, parallel genetic, genetic based"],"ranking":[["58941|GECCO|2010|On the problems of using learning classifier systems for fraud detection|Fraud detection problems have some uniquely challenging properties which make them difficult. In this paper, we investigate the fraud detection problem by describing the common properties of electronic fraud and examining how learning classifier systems (LCSs) can be applied to it. Also, we introduce \"random Boolean function\" (RBF) an abstract problem with high level of controllability which can be tuned to exhibit those characteristics individually, and report the results of using XCSR (a continuous variant of LCS) on RBF problem and also on a real-world problem. Results from our experiments demonstrate that XCSR can overcome most of the difficulties inherent to the fraud detection problem and can achieve good performance in case of the real-world problem.|Mohammad Behdad,Tim French,Luigi Barone,Mohammed Bennamoun","57595|GECCO|2006|Coordination number prediction using learning classifier systems performance and interpretability|The prediction of the coordination number (CN) of an amino acid in a protein structure has recently received renewed attention. In a recent paper, Kinjo et al. proposed a real-valued definition of CN and a criterion to map it onto a finite set of classes, in order to predict it using classification approaches. The literature reports several kinds of input information used for CN prediction. The aim of this paper is to assess the performance of a state-of-the-art learning method, Learning Classifier Systems (LCS) on this CN definition, with various degrees of precision, based on several combinations of input attributes. Moreover, we will compare the LCS performance to other well-known learning techniques. Our experiments are also intended to determinethe minimum set of input information needed to achieve good predictive performance, so as to generate competent yet simple and interpretable classification rules. Thus, the generated predictors (rule sets) are analyzed for their interpretability.|Jaume Bacardit,Michael Stout,Natalio Krasnogor,Jonathan D. Hirst,Jacek Blazewicz","57218|GECCO|2003|Towards Learning Classifier Systems for Continuous-Valued Online Environments|Previous work has studied the use of interval representations in XCS to allow its use in continuous-valued environments. Here we compare the speed of learning of continuous-valued versions of ZCS and XCS with a simple model of an online environment.|Christopher Stone,Larry Bull","57804|GECCO|2006|A dynamic approach to artificial immune systems utilizing neural networks|The purpose of this work is to propose an immune-inspired setup to use a self-organizing map as a computational model for the interaction of antigens and antibodies. The proposed approach may be used as a part in other immune algorithms, or can possibly be used to detect anomalies in time series data.|Stefan Schadwinkel,Werner Dilger","58220|GECCO|2007|Initial results from the use of learning classifier systems to control neuronal networks|In this paper we describe the use of a learning classifier system to control the electrical stimulation of cultured neuronal networks. The aim is to manipulate the environment of the cells such that they display elementary learning, i.e., so that they respond to a given input signal in a pre-specified way. Results indicate that this is possible and that the learned stimulation protocols identify seemingly fundamental properties of in vitro neuronal networks.allUse of another learning scheme and simpler stimulation confirms these properties.|Larry Bull,Ivan S. Uroukov","57507|GECCO|2005|Event-driven learning classifier systems for online soccer games|This paper reports on the application of classifier systems to the acquisition of decision-making algorithms for agents in online soccer games. The objective of this research is to support changes in the video-game environment brought on by the Internet and to enable the provision of bug-free programs in a short period of time. To achieve real-time learning during a game, a bucket brigade algorithm is used to reinforce learning by classifiers and a technique for selecting learning targets according to event frequency is adopted. A hybrid system combining an existing strategy algorithm and a classifier system is also employed. In experiments that observed the outcome of , soccer games between this event-driven classifier system and a human-designed algorithm, the proposed system was found to be capable of learning effective decision-making algorithms in real time.|Yuji Sato,Ryutaro Kanno","58635|GECCO|2009|Learning regulation functions of metabolic systems by artificial neural networks|Metabolic P systems, also called MP systems, are discrete dynamical systems which proved to be effective for modeling biological systems. Their dynamics is generated by means of a metabolic algorithm based on \"flux regulation functions\". A significant problem related to the generation of MP models from experimental data concerns the synthesis of these functions. In this paper we introduce a new approach to the synthesis of MP fluxes relying on neural networks as universal function approximators, and on evolutionary algorithms as learning techniques. This methodology is successfully tested in the case study of mitotic oscillator in early amphibian embryos.|Alberto Castellini,Vincenzo Manca","57748|GECCO|2006|A representational ecology for learning classifier systems|The representation used by a learning algorithm introduces a bias which is more or less well-suited to any given learning problem. It is well known that, across all possible problems, one algorithm is no better than any other. Accordingly, the traditional approach in machine learning is to choose an appropriate representation making use of some domain-specific knowledge, and this representation is then used exclusively during the learning process.To reduce reliance on domain-knowledge and its appropriate use it would be desirable for the learning algorithm to select its own representation for the problem.We investigate this with XCS, a Michigan-style Learning Classifier System.We begin with an analysis of two representations from the literature hyperplanes and hyperspheres. We then apply XCS with either one or the other representation to two Boolean functions, the well-known multiplexer function and a function defined by hyperspheres, and confirm that planes are better suited to the multiplexer and spheres to the sphere-based function.Finally, we allow both representations to compete within XCS, which learns the most appropriate representation for problem thanks to the pressure against overlapping rules which its niche GA supplies. The result is an ecology in which the representations are species.|James A. R. Marshall,Tim Kovacs","58397|GECCO|2008|An analysis of matching in learning classifier systems|We investigate rule matching in learning classifier systems for problems involving binary and real inputs. We consider three rule encodings the widely used character-based encoding, a specificity-based encoding, and a binary encoding used in Alecsys. We compare the performance of the three algorithms both on matching alone and on typical test problems. The results on matching alone show that the population generality influences the performance of the matching algorithms based on string representations in different ways. Character-based encoding becomes slower and slower as generality increases, specificity-based encoding becomes faster and faster as generality increases. The results on typical test problems show that the specificity-based representation can halve the time required for matching but also that binary encoding is about ten times faster on the most difficult problems. Moreover, we extend specificity-based encoding to real-inputs and propose an algorithm that can halve the time require for matching real inputs using an interval-based representation.|Martin V. Butz,Pier Luca Lanzi,Xavier Llor√†,Daniele Loiacono","57601|GECCO|2006|A Bayesian approach to learning classifier systems in uncertain environments|In this paper we propose a Bayesian framework for XCS , called BXCS. Following , we use probability distributions to represent the uncertainty over the classifier estimates of payoff. A novel interpretation of classifier and an extension of the accuracy concept are presented. The probabilistic approach is aimed at increasing XCS learning capabilities and tendency to evolve accurate, maximally general classifiers, especially when uncertainty affects the environment or the reward function. We show that BXCS can approximate optimal solutions in stochastic environments with a high level of uncertainty.|Davide Aliprandi,Alex Mancastroppa,Matteo Matteucci"],["58328|GECCO|2008|Hybridizing an evolutionary algorithm with mathematical programming techniques for multi-objective optimization|In recent years, the development of multi-objective evolutionary algorithms (MOEAs) hybridized with mathematical programming techniques has significantly increased. However, most of these hybrid approaches are gradient-based, and tend to require a high number of extra objective function evaluations to estimate the gradient information required. The use of nonlinear optimization approaches taken from the mathematical programming literature has been, however, less popular (although such approaches have been used with single-objective evolutionary algorithms). This paper precisely focuses on the design of a hybrid between a well-known MOEA (the NSGA-II) and two direct search methods taken from the mathematical programming literature (Nelder and Mead.s method and the golden section algorithm). The idea is to combine the explorative power of the evolutionary algorithm with the exploitative power of the direct search methods previously indicated (one is used for unidimensional functions and the other for multidimensional functions). Clearly, these mathematical programming techniques act as local search engines, whose goal is to refine the search performed by the MOEA. Our preliminary results indicate that this sort of hybridization is quite promising.|Sa√∫l Zapotecas Mart√≠nez,Carlos A. Coello Coello","57700|GECCO|2006|Incorporating directional information within a differential evolution algorithm for multi-objective optimization|The field of Differential Evolution (DE) has demonstrated important advantages in single objective optimization. To date, no previous research has explored how the unique characteristics of DE can be applied to multi-objective optimization. This paper explains and demonstrates how DE can provide advantages in multi-objective optimization using directional information. We present three novel DE variants for multi-objective optimization, and a report of their performance on four multi-objective problems with different characteristics. The DE variants are compared with the NSGA-II (Nondominated Sorting Genetic Algorithm). The results suggest that directional information yields improvements in convergence speed and spread of solutions.|Antony W. Iorio,Xiaodong Li","58459|GECCO|2008|A multi-start quantum-inspired evolutionary algorithm for solving combinatorial optimization problems|Quantum-inspired evolutionary algorithms (QIEAs), as a subset of evolutionary computation, are based on the principles of quantum computing such as quantum bits and quantum superposition. In this paper, we propose a multi-start quantum-inspired evolutionary algorithm, called MSQIEA. To improve the performance of the algorithm, a multi-measurement operator and a new strategy for updating the rotation angle is proposed. When Q-bit individuals start to converge to their final states, the best solution is stored and all Q-bits in each Q-bit individual are reinitialized. We compare the effectiveness of MSQIEA with a popular quantum-inspired evolutionary algorithm, called QEA, for solving - knapsack problem. The experimental results show that MSQIEA outperforms QEA and finds a solution with higher profit.|Parvaz Mahdabi,Saeed Jalili,Mahdi Abadi","59076|GECCO|2010|An archived-based stochastic ranking evolutionary algorithm asrea for multi-objective optimization|In this paper, we propose a new multi-objective optimization algorithm called Archived-based Stochastic Ranking Evolutionary Algorithm (ASREA) that ranks the population by comparing individuals with members of an archive. The stochastic comparison breaks the usual O(mn) complexity into O(man) (m being the number of objectives, a the size of the archive and n the population size), whereas updating the archive with distinct and well-spread non-dominated solutions and developed selection strategy retain the quality of state of the art deterministic multi-objective evolutionary algorithms (MOEAs). Comparison on ZDT and -objective DTLZ functions shows that ASREA converges on the Pareto-optimal front at least as well as NSGA-II and SPEA while reaching it much faster, and being cheaper on ranking comparisons.|Deepak Sharma,Pierre Collet","57425|GECCO|2005|A multi-objective genetic algorithm for robust design optimization|Real-world multi-objective engineering design optimization problems often have parameters with uncontrollable variations. The aim of solving such problems is to obtain solutions that in terms of objectives and feasibility are as good as possible and at the same time are least sensitive to the parameter variations. Such solutions are said to be robust optimum solutions. In order to investigate the trade-off between the performance and robustness of optimum solutions, we present a new Robust Multi-Objective Genetic Algorithm (RMOGA) that optimizes two objectives a fitness value and a robustness index. The fitness value serves as a measure of performance of design solutions with respect to multiple objectives and feasibility of the original optimization problem. The robustness index, which is based on a non-gradient based parameter sensitivity estimation approach, is a measure that quantitatively evaluates the robustness of design solutions. RMOGA does not require a presumed probability distribution of uncontrollable parameters and also does not utilize the gradient information of these parameters. Three distance metrics are used to obtain the robustness index and robust solutions. To illustrate its application, RMOGA is applied to two well-studied engineering design problems from the literature.|Mian Li,Shapour Azarm,Vikrant Aute","57298|GECCO|2005|Map-labelling with a multi-objective evolutionary algorithm|We present a multi-objective evolutionary algorithm approach to the map-labelling problem. Map-labelling involves placing labels for sites onto a map such that the result is easy to read and usable for navigation. However, map-users vary in their priorities and capabilities for example, sight-impaired users need to maximise font-size, whereas other users may be willing to accept smaller labels in exchange for increased clarity of bindings of labels to sites. With a multi-objective approach, we evolve a range of labellings from which users can select according to their particular circumstances. We present results from labelling two maps, including a difficult, dense map of Newcastle County in Delaware, which clearly illustrate the advantages of the multi-objective approach.|Lucas Bradstreet,Luigi Barone,R. Lyndon While","57416|GECCO|2005|A co-evolutionary hybrid algorithm for multi-objective optimization of gene regulatory network models|In this paper, the parameters of a genetic network for rice flowering time control have been estimated using a multi-objective genetic algorithm approach. We have modified the recently introduced concept of fuzzy dominance to hybridize the well-known Nelder Mead Simplex algorithm for better exploitation with a multi-objective genetic algorithm. A co-evolutionary approach is proposed to adapt the fuzzy dominance parameters. Additional changes to the previous approach have also been incorporated here for faster convergence, including elitism. Our results suggest that this hybrid algorithm performs significantly better than NSGA-II, a standard algorithm for multi-objective optimization.|Praveen Koduru,Sanjoy Das,Stephen Welch,Judith L. Roe,Zenaida P. Lopez-Dee","58358|GECCO|2008|AMGA an archive-based micro genetic algorithm for multi-objective optimization|In this paper, we propose a new evolutionary algorithm for multi-objective optimization. The proposed algorithm benefits from the existing literature and borrows several concepts from existing multi-objective optimization algorithms. The proposed algorithm employs a new kind of selection procedure which benefits from the search history of the algorithm and attempts to minimize the number of function evaluations required to achieve the desired convergence. The proposed algorithm works with a very small population size and maintains an archive of best and diverse solutions obtained so as to report a large number of non-dominated solutions at the end of the simulation. Improved formulation for some of the existing diversity preservation techniques is also proposed. Certain implementation aspects that facilitate better performance of the algorithm are discussed. Comprehensive benchmarking and comparison of the proposed algorithm with some of the state-of-the-art multi-objective evolutionary algorithms demonstrate the improved search capability of the proposed algorithm.|Santosh Tiwari,Patrick Koch,Georges Fadel,Kalyanmoy Deb","59085|GECCO|2010|Multiobjective evolutionary algorithm for software project portfolio optimization|Large software companies have to plan their project portfolio to maximize potential portfolio return and strategic alignment, while balancing various preferences, and considering limited resources. However, software project portfolios are challenging to describe for optimization in a practical way that allows efficient optimization. In this paper we propose an approach to describe software project portfolios with a set of multiobjective criteria for portfolio managers using the COCOMO II model and introduce a multiobjective evolutionary approach, mPOEMS, to find the Pareto-optimal front efficiently. The proposed approach was evaluated on a set of  projects that follow the validated COCOMO II model criteria. Major results are the proposed project portfolio management approach was found usable and useful the mPOEMS algorithm shows capabilities for efficiently solving the combinatorial optimization problem of this type.|Thomas Kremmel,Jir√≠ Kubal√≠k,Stefan Biffl","57221|GECCO|2003|Multi-objective Traffic Signal Timing Optimization Using Non-dominated Sorting Genetic Algorithm II|This paper presents the application of Non- dominated Sorting Genetic Algorithm II (NSGA II) in solving multiple-objective signal timing optimization problem (MOSTOP). Some recent researches on intersection signal timing design optimization and multi-objective evolutionary algorithms are summarized. NSGA II, which can find more of the Pareto Frontiers and maintain the diversity of the population, is applied to solve three signal timing optimization problems with -objective and -constraint, which account for both deterministic and stochastic traffic patterns. Mathematical approximation of the resulting Pareto Frontiers are developed to provide more insight into the trade-off between different objectives. GAs experimental design and result analysis are presented with some recommendations for prospective applications. The ACM Portal is published by the Association for Computing Machinery. Copyright   ACM, Inc. Terms of Usage Privacy Policy Code of Ethics Contact Us Useful downloads Adobe Acrobat QuickTime Windows Media Player Real Player|Dazhi Sun,Rahim F. Benekohal,S. Travis Waller"],["58348|GECCO|2008|Greedy heuristics and evolutionary algorithms for the bounded minimum-label spanning tree problem|Given an edge-labeled, connected, undirected graph G and a bound r, the bounded minimum-label spanning tree problem seeks a spanning tree on G whose edges carry the fewest possible labels and in which no label appears more than r times. Two greedy heuristics for the unbounded version of the problem are adapted to the bounded version. Two genetic algorithms for the problem encode labeled spanning trees as permutations of G's edges. A simple GA performs poorly, but the addition of local search enables consistently good results.|Arindam Khaled,Bryant A. Julstrom","58327|GECCO|2008|The node-depth encoding analysis and application to the bounded-diameter minimum spanning tree problem|The node-depth encoding has elements from direct and indirect encoding for trees which encodes trees by storing the depth of nodes in a list. Node-depth encoding applies specific search operators that is a typical characteristic for direct encodings. An investigation into the bias of the initialization process and the mutation operators of the node-depth encoding shows that the initialization process has a bias to solutions with small depths and diameters, and a bias towards stars. This investigation, also, shows that the mutation operators are unbiased. The performance of node-depth encoding is investigated for the bounded-diameter minimum spanning tree problem. The results are presented for Euclidean instances presented in the literature. In contrast with the expectation, the evolutionary algorithm using the biased initialization operator does not allow evolutionary algorithms to find better solutions compared to an unbiased initialization. In comparison to other evolutionary algorithms for the bounded-diameter minimum spanning tree evolutionary algorithms using the node-depth encoding have a good performance.|Telma Woerle de Lima,Franz Rothlauf,Alexandre C. B. Delbem","57771|GECCO|2006|An effective genetic algorithm for the minimum-label spanning tree problem|Given a connected, undirected graph G with labeled edges, the minimum label spanning tree problem seeks a spanning tree on G to whose edges are attached the smallest possible number of labels. A greedy heuristic for this NP-hard problem greedily chooses labels so as to reduce the number of components in the subgraphs they induce as quickly as possible. A genetic algorithm for the problem encodes candidate solutions as per mutations of the labels an initial segment of such a chromosome lists the labels that appear on the edges in the chromosome's tree. Three versions of the GA apply generic or heuristic crossover and mutation operators and a local search step. In tests on  randomly-generated instances of the minimum-label spanning tree problem, versions of the GA that apply generic operators, with and without the local search step, perform less well than the greedy heuristic, but a version that applies the local search step and operators tailored to the problem returns solutions that require on average  fewer labels than the heuristic's.|Jeremiah Nummela,Bryant A. Julstrom","59108|GECCO|2010|An efficient algorithm for generalized minimum spanning tree problem|The Generalized Minimum Spanning Tree problem (GMST) has attracted much attention during the last few years. Since it is in-tractable, many heuristic algorithms have been proposed to solve large GMST instances. Motivated by the effectiveness and effi-ciency of the muscle (the union of all optimal solutions) for solv-ing other NP-hard problems, we investigate how to incorporate the muscle into heuristic design for GMST. Firstly, we demon-strate that it's NP-hard to obtain the muscle for GMST. Then we show that the muscle can be well approximated by the principle and subordinate candidate sets, which can be calculated on a re-duced version of GMST. Therefore, a Dynamic cAndidate set based Search Algorithm (DASA) is presented in this paper for GMST. In contrast to existing heuristics, DASA employs those candidate sets to initialize and optimize solutions. During the search process, those candidate sets are dynamically adjusted to include in new features provided by good solutions. Since those candidate sets cover almost all optimal solutions, the search space of DASA can be dramatically reduced so that elite solutions can be easily found in a short time. Extensive experiments demon-strate that our new algorithm slightly outperforms existing heuris-tic algorithms in terms of solution quality.|He Jiang,Yudong Chen","58747|GECCO|2009|New heuristic and hybrid genetic algorithm for solving the bounded diameter minimum spanning tree problem|In this paper, we propose a new heuristic, called Center-Based Recursive Clustering - CBRC, for solving the bounded diameter minimum spanning tree (BDMST) problem. Our proposed hybrid genetic algorithm  is also extended to include the new heuristic and a multi-parent crossover operator. We test the new heuristic and genetic algorithm on two sets of benchmark problem instances for the Euclidean and Non-Euclidean cases. Experimental results show the effectiveness of the proposed heuristic and genetic algorithm.|Huynh Thi Thanh Binh,Robert I. McKay,Nguyen Xuan Hoai,Nguyen Duc Nghia","58583|GECCO|2009|Parallel particle swarm optimization applied to the protein folding problem|This article presents the implementation of a bio-inspired algorithm, which is the algorithm of particle swarm optimization (PSO) in with the objective of minimizing the function of conformational energy ECEPP for the protein folding problem (PFP) for real conformations considering structural restrictions. In this case, using a representation of torsion angles of the skeleton and the side chains, applying the sequence of amino acid of the peptide leu-enkephalin for the prediction of D structure of minimum energy. The quality of the results is compared with other techniques reported in literature. Subsequently, the PSO is used to predict the structure of unknown proteins.|Luis Germ√°n P√©rez-Hern√°ndez,Katya Rodr√≠guez-V√°zquez,Ram√≥n Gardu√±o-Ju√°rez","57923|GECCO|2007|Hybrid quantum particle swarm optimization algorithm for combinatorial optimization problem|In this paper, a framework of hybrid PSO is proposed by reasonablycombining the Q-bit evolutionary search of quantum PSO and binary bit evolutionary search of genetic PSO.|Jiahai Wang,Yalan Zhou","57976|GECCO|2007|A discrete particle swarm optimization algorithm for the generalized traveling salesman problem|Dividing the set of nodes into clusters in the well-known traveling salesman problem results in the generalized traveling salesman problem which seeking a tour with minimum cost passing through only a single node from each cluster. In this paper, a discrete particle swarm optimization is presented to solve the problem on a set of benchmark instances. The discrete particle swarm optimization algorithm exploits the basic features of its continuous counterpart. It is also hybridized with a local search, variable neighborhood descend algorithm, to further improve the solution quality. In addition, some speed-up methods for greedy node insertions are presented. The discrete particle swarm optimization algorithm is tested on a set of benchmark instances with symmetric distances up to  nodes from the literature. Computational results show that the discrete particle optimization algorithm is very promising to solve the generalized traveling salesman problem.|Mehmet Fatih Tasgetiren,Ponnuthurai N. Suganthan,Quan-Qe Pan","58676|GECCO|2009|Extending evolutionary algorithms to discover tri-criterion and non-supported solutions for the minimum spanning tree problem|The study of multi-criterion minimum spanning trees is important as many optimization problems in networks, such as communication, transport and utilities can be represented by this model. Conventional evolutionary approaches struggle to discover near-optimal solutions due to the combinatorial search space, and the difficulty in discovering the non-supported solutions. Recently, a knowledge-based evolutionary approach, KEA, has been developed that overcomes some of the problems of the earlier algorithms as it is not restricted to the bi-criterion case, finds non-supported solutions and scales well to larger problems however, the mid-point of its Pareto front is often dominated by alternative algorithms where they are applicable. Novel extensions to KEA, increasing the knowledge of the mid-point, termed KEA-W are examined, eliminating the mid-point deficiencies at the cost of computational time.|Madeleine Davis-Moradkhan,Will N. Browne,Peter Grindrod","57390|GECCO|2005|The blob code is competitive with edge-sets in genetic algorithms for the minimum routing cost spanning tree problem|Among the many codings of spanning trees for evolutionary search are those based on bijections between Prfer strings---strings of n- vertex labels---and spanning trees on the labeled vertices. One of these bijections, called the Blob Code, showed promise as an evolutionary coding, but EAs that use it to represent spanning trees have not performed well. Here, a genetic algorithm that represents spanning trees via the Blob Code is faster than, and returns results competitive with those of, a GA that encodes spanning trees as edge-sets on Euclidean instances of the minimum routing cost spanning tree problem. On instances whose edge weights have been chosen at random, the Blob-coded GA maintains its time advantage, but its results are inferior to those of the edge-set-coded GA, and both GAs are hard pressed to keep up with a simple stochastic hill-climber on all the test instances.|Bryant A. Julstrom"],["58970|GECCO|2010|The estimation of hlderian regularity using genetic programming|This paper presents a Genetic Programming (GP) approach to synthesize estimators for the pointwise Hlder exponent in D signals. It is known that irregularities and singularities are the most salient and informative parts of a signal. Hence, explicitly measuring these variations can be important in various domains of signal processing. The pointwise Hlder exponent provides a characterization of these types of features. However, current methods for estimation cannot be considered to be optimal in any sense. Therefore, the goal of this work is to automatically synthesize operators that provide an estimation for the Hlderian regularity in a D signal. This goal is posed as an optimization problem in which we attempt to minimize the error between a prescribed regularity and the estimated regularity given by an image operator. The search for optimal estimators is then carried out using a GP algorithm. Experiments confirm that the GP-operators produce a good estimation of the Hlder exponent in images of multifractional Brownian motions. In fact, the evolved estimators significantly outperform a traditional method by as much as one order of magnitude. These results provide further empirical evidence that GP can solve difficult problems of applied mathematics.|Leonardo Trujillo,Pierrick Legrand,Jacques L√©vy V√©hel","57020|GECCO|2002|Hyperspectral Image Analysis Using Genetic Programming|Genetic programming is used to evolve mineral identification functions for hyperspectral images. The input image set comprises  images from different wavelengths ranging from nm (visible blue) to nm (invisible shortwave in the infrared), taken over Cuprite, Nevada, with the AVIRIS hyperspectral sensor. A composite mineral image indicating the overall reflectance percentage of three minerals (alunite, kaolnite, buddingtonite) is used as a reference or ''solution'' image. The training set is manually selected from this composite image, and results are cross-validated with the remaining image data not used for training. The task of the GP system is to evolve mineral identifiers, where each identifier is trained to identify one of the three mineral specimens. A number of different GP experiments were undertaken, which parameterized features such as thresholded mineral reflectance intensity and target GP language. The results are promising, especially for minerals with higher reflectance thresholds, which indicate more intense concentrations.|Brian J. Ross,Anthony G. Gualtieri,Frank Fueten,Paul Budkewitsch","57632|GECCO|2006|Using a genetic algorithm to evolve cellular automata for DD computational development|Form generation or morphogenesis is one of the main stages of both artificial and natural development. This paper provides results from experiments in which a genetic algorithm (GA) was used to evolve cellular automata (CA) to produce predefined D and D shapes. The GA worked by evolving the CA rule table and the number of iterations that the model was to run. After the final chromosomes were obtained for all shapes, the CA model was allowed to run starting with a single cell in the middle of the lattice until the allowed number of iterations was reached and a shape was formed. In all cases, mean fitness values of evolved chromosomes were above .|Arturo Chavoya,Yves Duthen","57703|GECCO|2006|On evolving buffer overflow attacks using genetic programming|In this work, we employed genetic programming to evolve a \"white hat\" attacker that is to say, we evolve variants of an attack with the objective of providing better detectors. Assuming a generic buffer overflow exploit, we evolve variants of the generic attack, with the objective of evading detection by signature-based methods. To do so, we pay particular attention to the formulation of an appropriate fitness function and partnering instruction set. Moreover, by making use of the intron behavior inherent in the genetic programming paradigm, we are able to explicitly obfuscate the true intent of the code. All the resulting attacks defeat the widely used 'Snort' Intrusion Detection System.|Hilmi G√ºnes Kayacik,Malcolm I. Heywood,A. Nur Zincir-Heywood","58114|GECCO|2007|Coevolution of intelligent agents using cartesian genetic programming|A coevolutionary competitive learning environment for two antagonistic agents is presented. The agents are controlled by a new kind of computational network based on a compartmentalised model of neurons. We have taken the view that the genetic basis of neurons is an important  and neglected aspect of previous approaches. Accordingly, we have defined a collection of chromosomes representing various aspects of the neuron soma, dendrites and axon branches, and synaptic connections. Chromosomes are represented and evolved using a form of genetic programming known as Cartesian Genetic Programming. The network formed by running the chromosomal programs has a highly dynamic morphology in which neurons grow, and die, and neurite branches together with synaptic connections form and change in response to environmental interactions. The idea of this paper is to demonstrate the importance of the genetic transfer of learned experience and life time learning. The learning is a consequence of the complex dynamics produced as a result of interaction (coevolution) between two intelligent agents. Our results show that both agents exhibit interesting learning capabilities.|Gul Muhammad Khan,Julian Francis Miller,David M. Halliday","57450|GECCO|2005|Evolution of a human-competitive quantum fourier transform algorithm using genetic programming|In this paper, we show how genetic programming (GP) can be used to evolve system-size-independent quantum algorithms, and present a human-competitive Quantum Fourier Transform (QFT) algorithm evolved by GP.|Paul Massey,John A. Clark,Susan Stepney","57053|GECCO|2003|Data Classification Using Genetic Parallel Programming|A novel Linear Genetic Programming (LGP) paradigm called Genetic Parallel Programming (GPP) has been proposed to evolve parallel programs based on a Multi-ALU Processor. It is found that GPP can evolve parallel programs for Data Classification problems. In this paper, five binary-class UCI Machine Learning Repository databases are used to test the effectiveness of the proposed GPP-classifier. The main advantages of employing GPP for data classification are ) speeding up evolutionary process by parallel hardware fitness evaluation and ) discovering parallel algorithms automatically. Experimental results show that the GPP-classifier evolves simple classification programs with good generalization performance. The accuracies of these evolved classifiers are comparable to other existing classification algorithms.|Sin Man Cheang,Kin-Hong Lee,Kwong-Sak Leung","57881|GECCO|2007|Evolution of non-uniform cellular automata using a genetic algorithm diversity and computation|We used a genetic algorithm to evaluate the cost  benefit of diversity in evolving sets of rules for non-uniform cellular automata solving the density classification problem.|Forrest Sondahl,William Rand","58332|GECCO|2008|Fault tolerant control using Cartesian genetic programming|The paper focuses on the evolution of algorithms for control of a machine in the presence of sensor faults, using Cartesian Genetic Programming. The key challenges in creating training sets and a fitness function that encourage a general solution are discussed. The evolved algorithms are analysed and discussed. It was found that highly novel, mathematically elegant and hitherto unknown solutions were found.|Yoshikazu Hirayama,Tim Clarke,Julian Francis Miller","58715|GECCO|2009|Pareto front feature selection using genetic programming to explore feature space|In this paper we use genetic programming (GP) for feature selection in binary classification tasks. Mathematical expressions built by GP transform the feature space in a way that the relevance of subsets of features can be measured using a simple relevance function. We make some modifications to the standard GP to make it explore large subsets of features when necessary. This is done by increasing the depth limit at run-time and at the same time trying to avoid bloating and overfitting by some control mechanism. We take a filter (non-wrapper) approach to exploring the search space. Unlike most filter methods that usually deal with single features, we explore subsets of features. The solution of the proposed search is a vector of Pareto-front points. Our experiments show that a linear search over this vector can improve the classification performance of classifiers while decreasing their complexity.|Kourosh Neshatian,Mengjie Zhang"],["58505|GECCO|2008|An estimation distribution algorithm with the spearmans rank correlation index|This article arguments that rank correlation coefficients are powerful association measures and how can they be adopted by EDAs. A new EDA implements the proposed ideas the Non-Parametric Real-valued Estimation Distribution Algorithm (NOPREDA). The paper fully describes the rank correlation coefficient, and the procedure to build a non parametric model for the probability distribution of the source data. A benchmark of global optimization problems is solved with NOPREDA.|Arturo Hern√°ndez Aguirre,Enrique Ra√∫l Villa Diharce,Selma Barba-Moreno","58962|GECCO|2010|An estimation of distribution algorithm for the automatic generation of clustering algorithms|A prominent Artificial Intelligence research area is automatic programming -- the generation of a computer program by another computer program. We propose the use of Estimation of Distribution Algorithms (EDA) for the artificial generation of density-based clustering algorithms -- a class of data mining algorithms. Preliminary experimental results compare the clustering algorithms artificially generated by AutoClustering to DBSCAN, a well-known manually-designed algorithm.|Aruanda Sim√µes Goncalves Meiguins,Alex Alves Freitas,Roberto C√©lio Lim√£o de Oliveira,Samuel F. S. Junior,Bianchi Serique Meiguins","57951|GECCO|2007|An estimation of distribution algorithm with guided mutation for a complex flow shop scheduling problem|An Estimation of Distribution Algorithm (EDA) is proposed toapproach the Hybrid Flow Shop with Sequence Dependent Setup Times and Uniform Machines in parallel (HFS-SDST-UM) problem. The latter motivated by the needs of a real world company. The proposed EDA implements a fairly new mechanism to improve the search of more traditional EDAs. This is the Guided Mutation (GM). EDA-GM generates new solutions by using the information from a probability model, as all EDAs, and the local information from a good known solution. The approach is tested on several instances of HFS-SDST-UM and compared with adaptations of meta-heuristics designed for very similarproblems. Encouraging results are reported.|Abdellah Salhi,Jos√© Antonio V√°zquez Rodr√≠guez,Qingfu Zhang","58344|GECCO|2008|An application of a multivariate estimation of distribution algorithm to cancer chemotherapy|Chemotherapy treatment for cancer is a complex optimisation problem with a large number of interacting variables and constraints. A number of different heuristics have been applied to it with varying success. In this paper we expand on this by applying two estimation of distribution algorithms to the problem. One is UMDA and the other is hBOA, the first EDA using a multivariate probabilistic model to be applied to the chemotherapy problem. While instinct would lead us to predict that the more sophisticated algorithm would yield better performance on a complex problem like this, we show that it is outperformed by the algorithms using the simpler univariate model. We hypothesise that this is caused by the more sophisticated algorithm being impeded by the large number of interactions in the problem which though present, do not complicate the search for optima.|Alexander E. I. Brownlee,Martin Pelikan,John A. W. McCall,Andrei Petrovski","58736|GECCO|2009|Initial-population bias in the univariate estimation of distribution algorithm|This paper analyzes the effects of an initial-population bias on the performance of the univariate marginal distribution algorithm (UMDA). The analysis considers two test problems () onemax and () noisy onemax. Theoretical models are provided and verified with experiments. Intuitively, biasing the initial population toward the global optimum should improve performance of UMDA, whereas biasing the initial population away from the global optimum should have the opposite effect. Both theoretical and experimental results confirm this intuition. Effects of mutation on performance of UMDA with initial-population bias are also investigated.|Martin Pelikan,Kumara Sastry","57789|GECCO|2006|Optimising cancer chemotherapy using an estimation of distribution algorithm and genetic algorithms|This paper presents a methodology for using heuristic search methods to optimise cancer chemotherapy. Specifically, two evolutionary algorithms - Population Based Incremental Learning (PBIL), which is an Estimation of Distribution Algorithm (EDA), and Genetic Algorithms (GAs) have been applied to the problem of finding effective chemotherapeutic treatments. To our knowledge, EDAs have been applied to fewer real world problems compared to GAs, and the aim of the present paper is to expand the application domain of this technique.We compare and analyse the performance of both algorithms and draw a conclusion as to which approach to cancer chemotherapy optimisation is more efficient and helpful in the decision-making activity led by the oncologists.|Andrei Petrovski,Siddhartha Shakya,John A. W. McCall","57573|GECCO|2005|On the convergence of an estimation of distribution algorithm based on linkage discovery and factorization|Estimation of distribution algorithms construct an explicit model of the problem to be solved, and then use this model to guide the search for good solutions. For an important class of fitness functions, namely those with k-bounded epistasis, it is possible to construct a complete explicit representation of the fitness function by sampling the fitness function. A very natural model of the problem to be solved is the Boltzmann distribution of the fitness function, which is an exponential of the fitness normalized to a probability distribution. As the exponentiation factor (inverse temperature) of the Boltzmann distribution is increased, probability is increasingly concentrated on the set of optimal points. We show that for fitness functions of k-bounded epistasis that satisfy an additional property called the running intersection property, an explicit computable exact factorization of the Boltzmann distribution with an arbitrary exponentiation factor can be constructed. This factorization allows the Boltzmann distribution to be efficiently sampled, which leads to an algorithm which finds the optimum with high probability.|Alden H. Wright,Sandeep Pulavarty","58433|GECCO|2008|Combining cartesian genetic programming with an estimation of distribution algorithm|This paper describes initial testing of a novel idea to combine a CGP with an EDA. In recent work a new improved crossover technique was successfully applied to a CGP. To implement the new method meant changing the traditional CGP representation. The new representation developed in that work lends itself very nicely to some probability distribution being implemented. The work in this paper has investigated this idea of incoporating estimated probability distributions into the new CGP method with crossover.|Janet Clegg","57186|GECCO|2003|Reinforcement Learning Estimation of Distribution Algorithm|This paper proposes an algorithm for combinatorial optimizations that uses reinforcement learning and estimation of joint probability distribution of promising solutions to generate a new population of solutions. We call it Reinforcement Learning Estimation of Distribution Algorithm (RELEDA). For the estimation of the joint probability distribution we consider each variable as univariate. Then we update the probability of each variable by applying reinforcement learning method. Though we consider variables independent of one another, the proposed method can solve problems of highly correlated variables. To compare the efficiency of our proposed algorithm with other Estimation of Distribution Algorithms (EDAs) we provide the experimental results of the two problems four peaks problem and bipolar function.|Topon Kumar Paul,Hitoshi Iba","58204|GECCO|2007|Population sizing for entropy-based model building in discrete estimation of distribution algorithms|This paper proposes a population-sizing model for entropy-based model building in discrete estimation of distribution algorithms. Specifically, the population size required for building an accurate model is investigated. The effect of selection pressure on population sizing is also preliminarily incorporated. The proposed model indicates that the population size required for building an accurate model scales as (m log m), where m is the number of substructures of the given problem and is proportional to the problem size. Experiments are conducted to verify the derivations, and the results agree with the proposed model.|Tian-Li Yu,Kumara Sastry,David E. Goldberg,Martin Pelikan"],["57966|GECCO|2007|Discovering structures in gene regulatory networks using genetic programming and particle swarms|In this paper, we describe a Genetic Programming and Particle Swarm Hybrid algorithm for Gene Network discovery.|Xinye Cai,Stephen Welch,Praveen Koduru,Sanjoy Das","58574|GECCO|2009|Evolving specific network statistical properties using a gene regulatory network model|The generation of network topologies with specific, user-specified statistical properties is addressed using an Evolutionary Algorithm that is seeded by an Artificial Gene Regulatory Network Model. The work presented here extends previous work where the proposed approach was demonstrated to be able to evolve scale-free topologies. The present results reinforce the applicability of the proposed method, showing that the evolution of small-world topologies is also possible, but requires a carefully crafted fitness function.|Miguel Nicolau,Marc Schoenauer","58865|GECCO|2009|On the evolution of neural networks for pairwise classification using gene expression programming|Neural networks are a common choice for solving classification problems, but require experimental adjustments of the topology, weights and thresholds to be effective. Success has been seen in the development of neural networks with evolutionary algorithms, making the extension of this work to classification problems a logical step. This paper presents the first known use of the Gene Expression Programming-based GEP-NN algorithm to design neural networks for classification purposes. The system uses pairwise decomposition to produce a series of binary classifiers for a given multi-class problem, with the results of the classifier set being combined by majority vote.|Stephen Johns,Marcus V. dos Santos","57512|GECCO|2005|Using gene deletion and gene duplication in evolution strategies|Self-adaptation of the mutation strengths is a powerful mechanism in evolution strategies (ES), but it can fail. As a consequence premature convergence or ending up in a local optimum in multi-modal fitness landscapes can occur. In this article a new approach controlling the process of self-adaptation is proposed. This approach combines the old ideas of gene deletion and gene duplication with the self-adaptation mechanism of the ES. Gene deletion and gene duplication is used to vary the number of independent mutation strengths. In order to demonstrate the practicability of the new approach several multi-modal test functions are used. Methods from statistical design of experiments and regression tree methods are applied to improve the performance of a specific heuristic-problem combination.|Karlheinz Schmitt","57462|GECCO|2005|Inference of gene regulatory networks using s-system and differential evolution|In this work we present an improved evolutionary method for inferring S-system model of genetic networks from the time series data of gene expression. We employed Differential Evolution (DE) for optimizing the network parameters to capture the dynamics in gene expression data. In a preliminary investigation we ascertain the suitability of DE for a multimodal and strongly non-linear problem like gene network estimation. An extension of the fitness function for attaining the sparse structure of biological networks has been proposed. For estimating the parameter values more accurately an enhancement of the optimization procedure has been also suggested. The effectiveness of the proposed method was justified performing experiments on a genetic network using different numbers of artificially created time series data.|Nasimul Noman,Hitoshi Iba","58916|GECCO|2010|Image compression of natural images using artificial gene regulatory networks|A novel approach to image compression using a gene regulatory network (GRN) based artificial developmental system (ADS) is introduced. The proposed algorithm exploits the fact that a series of complex organisms ( developmental states) can be represented via a GRN description and the indices of the developmental steps in which they occur. Organisms are interpreted as tiles of an image at each developmental step which results in the (re-)construction of an image during the developmental process. It is shown that GRNs are suitable for image compression and achieve higher compression rates than JPEG when optimised for a particular image. It is also shown that the same GRN has the potential to encode multiple images, each represented by a different series of numbers of developmental steps.|Martin Trefzer,T√ºze Kuyucu,Julian F. Miller,Andy M. Tyrrell","58034|GECCO|2007|Clustering gene expression data via mining ensembles of classification rules evolved using moses|A novel approach, model-based clustering, is described foridentifying complex interactions between genes or gene-categories based on static gene expression data. The approach deals with categorical data, which consists of a set of gene expressionprofiles belonging to one category, and a set belonging to anothercategory. An evolutionary algorithm (Meta-Optimizing Semantic Evolutionary Search, or MOSES) is used to learn an ensemble of classification models distinguishing the two categories, based on inputs that are features corresponding to gene expression values. Each feature is associated with a model-based vector, which encodes quantitative information regarding the utilization of the feature across the ensembles of models. Two different ways of constructing these vectors are explored. These model-based vectors are then clustered using a variant of hierarchical clustering called Omniclust. The result is a set of model-based clusters, in which features are gathered together if they are often considered together by classification models -- which may be because they're co-expressed, or may be for subtler reasons involving multi-gene interactions. The method is illustrated by applying it to two datasets regarding human gene expression, one drawn from brain cells and pertinent to the neurogenetics of aging, and the other drawn from blood cells and relating to differentiating between types of lymphoma. We find that, compared to traditional expression-based clustering, the new method often yields clusters that have higher mathematical quality (in the sense of homogeneity and separation) and also yield novel and meaningful insights into the underlying biological processes.|Moshe Looks,Ben Goertzel,L√∫cio de Souza Coelho,Mauricio Mudado,Cassio Pennachin","57032|GECCO|2003|Artificial Immune System for Classification of Gene Expression Data|DNA microarray experiments generate thousands of gene expression measurement simultaneously. Analyzing the difference of gene expression in cell and tissue samples is useful in diagnosis of disease. This paper presents an Artificial Immune System for classifying microarray-monitored data. The system evolutionarily selects important features and optimizes their weights to derive classification rules. This system was applied to two datasets of cancerous cells and tissues. The primary result found few classification rules which correctly classified all the test samples and gave some interesting implications for feature selection.|Shin Ando,Hitoshi Iba","57934|GECCO|2007|Evolutionary selection of minimum number of features for classification of gene expression data using genetic algorithms|Selecting the most relevant factors from genetic profiles that can optimally characterize cellular states is of crucial importance in identifying complex disease genes and biomarkers for disease diagnosis and assessing drug efficiency. In this paper, we present an approach using a genetic algorithm for a feature subset selection problem that can be used in selecting the near optimum set of genes for classification of cancer data. In substantial improvement over existing methods, we classified cancer data with high accuracy with less features.|Alper K√º√ß√ºkural,Reyyan Yeniterzi,S√ºveyda Yeniterzi,Osman Ugur Sezerman","58267|GECCO|2008|The gene regulatory network an application to optimal coverage in sensor networks|This paper proposes a new approach for biologically inspired computing on the basis of Gene Regulatory Networks. These networks are models of genes and dynamic interactions that take place between them. The differential equation representations of such networks resemble neural networks as well as idiotypic networks in immune system. Although several potential applications have been outlined, an example, the problem of placing sensors optimally in a distributed environment is considered in detail. A comparison with NSGA-II suggest that the new method is able to accomplish near-optimal coverage of sensors in a network.|Sanjoy Das,Praveen Koduru,Xinye Cai,Stephen Welch,Venkatesh Sarangan"],["57951|GECCO|2007|An estimation of distribution algorithm with guided mutation for a complex flow shop scheduling problem|An Estimation of Distribution Algorithm (EDA) is proposed toapproach the Hybrid Flow Shop with Sequence Dependent Setup Times and Uniform Machines in parallel (HFS-SDST-UM) problem. The latter motivated by the needs of a real world company. The proposed EDA implements a fairly new mechanism to improve the search of more traditional EDAs. This is the Guided Mutation (GM). EDA-GM generates new solutions by using the information from a probability model, as all EDAs, and the local information from a good known solution. The approach is tested on several instances of HFS-SDST-UM and compared with adaptations of meta-heuristics designed for very similarproblems. Encouraging results are reported.|Abdellah Salhi,Jos√© Antonio V√°zquez Rodr√≠guez,Qingfu Zhang","58841|GECCO|2009|Comparison of similarity measures for the multi-objective vehicle routing problem with time windows|The Vehicle Routing Problem can be seen as a fusion of two well known combinatorial problems, the Travelling Salesman Problem and Bin Packing Problem. It has several variants, the one with Time Windows being the case of study in this paper. Its main objective is to find the lowest-distance set of routes to deliver goods to customers, which have service time windows, using a fleet of identical vehicles with restricted capacity. We consider the simultaneous minimisation of the number of routes along with the total travel distance. Although previous research has considered evolutionary methods for solving this problem, none of them has concentrated on the similarity of solutions. We analyse here two methods to measure similarity, which are incorporated into an evolutionary algorithm to solve the multi-objective problem. We have applied this algorithm to a publicly available set of benchmark instances, and when these similarity measures are considered, our solutions are seen to be competitive or better than others previously published.|Abel Garcia-Najera,John A. Bullinaria","57663|GECCO|2006|A hybrid of genetic algorithm and bottleneck shifting for flexible job shop scheduling problemA hybrid of genetic algorithm and bottleneck shifting for flexible job shop scheduling problem|Flexible job shop scheduling problem (fJSP) is an extension of the classical job shop scheduling problem, which provides a closer approximation to real scheduling problems. We develop a new genetic algorithm hybridized with an innovative local search procedure (bottleneck shifting) for the fJSP problem. The genetic algorithm uses two representation methods to represent solutions of the fJSP problem. Advanced crossover and mutation operators are proposed to adapt to the special chromosome structures and the characteristics of the problem. The bottleneck shifting works over two kinds of effective neighborhood, which use interchange of operation sequences and assignment of new machines for operations on the critical path. In order to strengthen the search ability, the neighborhood structure can be adjusted dynamically in the local search procedure. The performance of the proposed method is validated by numerical experiments on several representative problems.|Jie Gao,Mitsuo Gen,Linyan Sun","57729|GECCO|2006|A new multi-objective evolutionary algorithm for solving high complex multi-objective problems|In this paper, a new multi-objective evolutionary algorithm for solving high complex multi-objective problems is presented based on the rule of energy minimizing and the law of entropy increasing of particle systems in phase space, Through the experiments it proves that this algorithm can quickly obtains the Pareto solutions with high precision and uniform distribution. And the results of the experiments show that this algorithm can avoid the premature phenomenon of problems better than the traditional evolutionary algorithm because it can drive all the individuals to participate in the evolving operation in each generation.|Kangshun Li,Xuezhi Yue,Lishan Kang,Zhangxin Chen","58198|GECCO|2007|Using evolutionary computation and local search to solve multi-objective flexible job shop problems|Finding realistic schedules for Flexible Job Shop Problems has attracted many researchers recently due to its NP-hardness. In this paper, we present an efficient approach for solving the multi-objective flexible job shop by combining Evolutionary Algorithm and Guided Local Search. Instead of applying random local search to find neighborhood solutions, we introduce a guided local search procedure to accelerate the process of convergence to Pareto-optimal solutions. The main improvement of this combination is to help diversify the population towards the Pareto-front. Empirical studies show that ) the gaps between the obtained results and known lower bounds are small, and ) the multi-objective solutions of our algorithms dominate previous designs for solving the same benchmarks while incurring less computational time.|Nhu Binh Ho,Joc Cing Tay","59064|GECCO|2010|Deterministic helper-objective sequences applied to job-shop scheduling|A Multiple Objective Evolutionary Algorithm (MOEA) applied to the Job-Shop Scheduling Problem has been shown in the past to perform better than a single objective Genetic Algorithm (GA). Helper-objectives, representing portions of the main objective, were used in the past to guide the MOEA search process. This paper explores additional understanding of helper-objective sequencing. The sequence in which helper-objectives are used is examined and it is shown that problem specific knowledge can be incorporated to determine a good helper-objective sequence. Results demonstrate how carefully sequenced helper-objectives can improve search quality. Explanations are provided for how helpers accelerate the search process by distinguishing between otherwise similar solutions and by partial removal of epistasis in one or more dimensions. Good helper-objective sequence appears to break epistasis early in a search which implies that it is important for helper-objective methods to examine the sequence of objectives.|Darrell F. Lochtefeld,Frank W. Ciarallo","57739|GECCO|2006|MOGE GP classification problem decomposition using multi-objective optimization|A novel approach to classification is proposed in which a Pareto-based ranking of individuals is used to encourage multiple individuals to participate in the solution. To do so, the classification problem is re-expressed as a cluster consistency problem, thus allowing utilization of techniques from multi-objective optimization. Such a formulation enables classification problems to be automatically decomposed and solved by several specialist classifiers rather than by a single 'super' individual. In this paper, we demonstrate the proposed approach to two benchmark binary problems and recommend a natural extension to multi-class problems. Results indicate the general appropriateness of the approach.|Andrew R. McIntyre,Malcolm I. Heywood","58205|GECCO|2007|The multi-objective next release problem|This paper is concerned with the Multi-Objective Next Release Problem (MONRP), a problem in search-based requirements engineering. Previous work has considered only single objective formulations. In the multi-objective formulation, there are at least two (possibly conflicting) objectives that the software engineer wishes to optimize. It is argued that the multi-objective formulation is more realistic, since requirements engineering is characterised by the presence of many complex and conflicting demands, for which the software engineer must find a suitable balance. The paper presents the results of an empirical study into the suitability of weighted and Pareto optimal genetic algorithms, together with the NSGA-II algorithm, presenting evidence to support the claim that NSGA-II is well suited to the MONRP. The paper also provides benchmark data to indicate the size above which the MONRP becomes non--trivial.|Yuanyuan Zhang,Mark Harman,S. Afshin Mansouri","59114|GECCO|2010|Solving multiobjective flexible job-shop scheduling using an adaptive representation|In this paper, we present an alternative representation for solving multiobjective Flexible Job-shop Scheduling Problems (FJSP). In FJSP, there may be a choice of machines that can perform any given operation. In order to schedule an operation, it needs to be assigned a machine first, a process known as routing. Most previous approaches to solving FJSP assigned machines to all schedules before beginning any scheduling. In our approach, Adaptive Representation (AdRep), we assign a machine to an operation just at the time it is ready to be scheduled, allowing the routing process to incorporate information from the scheduling environment. Experimental results show that although AdRep performance does not scale as well with problem size as some other approaches that are not simultaneously searching for machine assignments, it is able to find all best published solutions on a three-objective Pareto front including makespan, total workload, and maximum workload on any machine, while its simultaneous routing search opens up new possibilities for optimality of rescheduling in response to machine failure.|Prakarn Unachak,Erik D. Goodman","57772|GECCO|2006|Multi-objective optimisation of the protein-ligand docking problem in drug discovery|The pharmaceutical industry is facing an ever-increasing demand to discover novel drugs that are more effective and safer than existing ones. The industry faces huge problem in improving its drug discovery and development processes since formerly used methods have shown their limits. Additionally, tests for safety of drugs are performed at the later end of the drug discovery pipeline instead of earlier. Therefore, the industry is looking for predictive tools that would be useful in testing the behaviour of a drug candidate earlier on in the pipeline before performing the large scale clinical tests. This paper explores the application of evolutionary multi-objective optimisation techniques for achieving such predictive work in protein-ligand docking. The paper reviews the literature of multi-objective optimisation and the drug discovery process and proposes a framework as a predictive tool to calculate good docking configuration for a given target protein and its binding compound. Finally existing models for drug evaluation are used for framework validation.|A. Oduguwa,A. Tiwari,S. Fiorentino,R. Roy"],["58782|GECCO|2009|TestFul using a hybrid evolutionary algorithm for testing stateful systems|This paper introduces TestFul, a framework for testing stateful systems and focuses on object-oriented software. TestFul employs a hybrid multi-objective evolutionary algorithm, to explore the space of feasible tests efficiently, and novel quality metrics, based on both def-use pairs and behavioral coverage, to judge the quality of tests. We compare our framework against random testing by considering the level of coverage, the size of generated tests, and the time required to generate the tests. Our preliminary results show the validity of the approach TestFul outperforms random testing in most of the cases.|Matteo Miraz,Pier Luca Lanzi,Luciano Baresi","58665|GECCO|2009|Evolutionary functional testing of continuous control systems|Evolutionary functional testing is an approach to automatically generating test cases that violate a certain functional system requirement. This paper proposes an approach suitable for efficiently testing complex continuous control systems using an evolutionary testing framework that has been optimized for deployment in the industrial domain. Features of this test environment include the ability of automatically generating and optimizing continuous test data sets. The efficiency of the method is assessed by performing an experimental case study and by comparison with random testing. Results of this work indicate high usability and efficiency of the proposed method.|Andreas Windisch,Felix F. Lindlar,Sebastian Topuz,Stefan Wappler","57256|GECCO|2003|An Evolutionary Approach for Molecular Docking|We have developed an evolutionary approach for the flexible docking that is now an important component of a rational drug design. This automatic docking tool, referred to as the GEMDOCK (Generic Evolutionary Method for DOCKing molecules), combines both global and local search strategies search mechanisms. GEMDOCKused a simple scoring function to recognize compounds by minimizing the energy of molecular interactions. The interactive types of atoms between ligands and proteins of our linear scoring function consist only hydrogen-bonding and steric terms. GEMDOCK has been tested on a diverse dataset of  protein-ligand complexes from Protein Data Bank. In total % of these complexes, it obtained docked ligand conformations with root mean square derivations (RMSD) to the crystal ligand structures less than .  when the ligand was docked back into the binding site. Experiments shows that the scoring function is simple and efficiently discriminates between native and non-native docked conformations. This study suggests that GEMDOCK is a useful tool for molecular recognition and is a potential docking tool for protein structure variations.|Jinn-Moon Yang","57149|GECCO|2003|Multicriteria Network Design Using Evolutionary Algorithm|In this paper, we revisit a general class of multicriteria multi-constrained network design problems and attempt to solve, in a novel way, with Evolutionary Algorithms (EAs). A major challenge to solving such problems is to capture possibly all the (representative) equivalent and diverse solutions. In this work, we formulate, without loss of generality, a bi-criteria bi- constrained communication network topological design problem. Two of the primary objectives to be optimized are network delay and cost subject to satisfaction of reliability and flowconstraints. This is a NP-hard problem so we use a hybrid approach (for initialization of the population) along with EA. Furthermore, the twoobjective optimal solution front is not known a priori. Therefore, we use a multiobjective EA which produces diverse solution space and monitors convergence the EA has been demonstrated to work effectively across complex problems of unknown nature. We tested this approach for designing networks of different sizes and found that the approach scales well with larger networks. Results thus obtained are compared with those obtained by two traditional approaches namely, the exhaustive search and branch exchange heuristics.|Rajeev Kumar,Nilanjan Banerjee","58210|GECCO|2007|An evolutionary multiobjective approach to design highly non-linear Boolean functions|The proliferation of all kinds of devices with different security requirements and constraints, and the arms-race nature of the security problem are increasingly demanding the development of tools to help on the automatic design of Boolean functions with security application. Nowadays, the design of strong cryptographic Boolean functions is a multiobjective problem. However, so far evolutionary multiobjective algorithms have been largely overlooked and not much is known about this problem from a multiobjective optimization perspective. In this work we focus on non-linearity related criteria and explore a multiobjective evolutionary approach aiming to find several balanced functions of similar characteristics satisfying multiple criteria. We show that the multiobjective approach is an efficient alternative to single objective optimization approaches presented so far. We also argue that it is a better framework for automatic design of cryptographic Boolean functions.|Hern√°n E. Aguirre,Hiroyuki Okazaki,Yasushi Fuwa","57030|GECCO|2003|Evolutionary Testing of Flag Conditions|Evolutionary Testing (ET) has been shown to be very successful in testing real world applications . However, it has been pointed out , that further research is necessary if flag variables appear in program expressions. The problems increase when ET is used to test state-based applications where the encoding of states hinders successful evolutionary tests. This is because the ET performance is reduced to a random test in case of the use of flag variables or variables that encode an enumeration type. The authors have developed an ET System to provide easy access to automatic testing. An extensive set of programs has been tested using this system , . This system is extended for new areas of software testing and research has been carried out to improve its performance. This paper introduces a new approach for solving ET problems with flag conditions. The problematic constructs are explained with the help of code examples originally found in large real world applications.|Andr√© Baresel,Harmen Sthamer","58283|GECCO|2008|Evolutionary design of dynamic SwarmScapes|This paper discusses interactive evolutionary algorithms and their application in swarm-based image generation. From an artist's perspective, the computer-generated patterns offer departure points for creative \"Imagineering.\" Input into our evolutionary system comprises of ninety-six parameters that influence the behavior of swarm agents to create emerging \"SwarmScapes\" over time. This paper demonstrates how an evolutionary approach is used to create swarm-based animations, which at any point in time can be turned into electronic paintings and into high-resolution plots on canvas. As our team consists of three computer scientists and an artist, we also explore the collaborative relationships among the team members, and between the artist and the evolutionary system.|Namrata Khemka,Scott Novakowski,Gerald Hushlak,Christian Jacob","57779|GECCO|2006|Adaption in distributed systems an evolutionary approach|There is a trend towards networked and distributed systems, complicating the design process of self-adaptive software. Logistics networks can be seen as a distributed system that have to adapt to requirements of companies and customers in a flexible and fast manner. When constructing and planning logistic networks different aspects of complexity have to be considered the number of stores, intermediate stores and transport entities that are required at every stage in a supply chain as well as the sufficient size of every store or transport entity. This paper presents an approach that simulates adaptive logistic networks using a multi-agent system (MAS) based on Evolutionary Computation (EC). Our approach uses fully decentralized operators for reproduction like mutation, recombination and selection, regulated by market mechanisms. The novelty of this approach lies in the decentralized bottom-up adaption method for decentralized systems and we use a logistic scenario as an example. Our proposed method is based on a formal model explaining how adaption occurs in the number and strategies of agents and thus of logistic networks. The implementation and experimental results are given to illustrate the expected outcomes.|Stephan Otto,Stefan Kirn","57440|GECCO|2005|Evolutionary testing of state-based programs|The application of Evolutionary Algorithms to structural test data generation, known as Evolutionary Testing, has to date largely focused on programs with input-output behavior. However, the existence of state behavior in test objects presents additional challenges for Evolutionary Testing, not least because certain test goals may require a search for a sequence of inputs to the test object. Furthermore, state-based test objects often make use of internal variables such as boolean flags, enumerations and counters for managing or querying their internal state. These types of variables can lead to a loss of information in computing fitness values, producing coarse or flat fitness landscapes. This results in the search receiving less guidance, and the chances of finding required test data are decreased.This paper proposes an extended approach based on previous works. Input sequences are generated, and internal variable problems are addressed through hybridization with an extended Chaining Approach. The basic idea of the Chaining Approach is to find a sequence of statements, involving internal variables, which need to be executed prior to the test goal. By requiring these statements are executed, information previously unavailable to the search can be made use of, possibly guiding it into potentially promising and unexplored areas of the test object's input domain. A number of experiments demonstrate the value of the approach.|Phil McMinn,Mike Holcombe","57164|GECCO|2003|The State Problem for Evolutionary Testing|This paper shows how the presence of states in test objects can hinder or render impossible the search for test data using evolutionary testing. Additional guidance is required to find sequences of inputs that put the test object into some necessary state for certain test goals to become feasible. It is shown that data dependency analysis can be used to identify program statements responsible for state transitions, and then argued that an additional search is needed to find required transition sequences. In order to be able to deal with complex examples, the use of ant colony optimization is proposed. The results of a simple initial experiment are reported.|Phil McMinn,Mike Holcombe"],["58348|GECCO|2008|Greedy heuristics and evolutionary algorithms for the bounded minimum-label spanning tree problem|Given an edge-labeled, connected, undirected graph G and a bound r, the bounded minimum-label spanning tree problem seeks a spanning tree on G whose edges carry the fewest possible labels and in which no label appears more than r times. Two greedy heuristics for the unbounded version of the problem are adapted to the bounded version. Two genetic algorithms for the problem encode labeled spanning trees as permutations of G's edges. A simple GA performs poorly, but the addition of local search enables consistently good results.|Arindam Khaled,Bryant A. Julstrom","58677|GECCO|2009|Multiobjective genetic programming approach to evolving heuristics for the bounded diameter minimum spanning tree problem MOGP for BDMST|The bounded-diameter (or diameter-constrained) minimum spanning tree (BDMST) problem is a well-studied combinatorial optimization problem for which several heuristics such as one-time tree construction (OTTC), center based tree construction(CBTC), iterative refinement (IR) and randomized greedy heuristics (RGH) have been developed. Very little work, however, has been done on producing heuristics for BDMSTs using evolutionary algorithms. In this paper we have used multiobjective genetic programming (MOGP) to explore the evolution of a set of heuristics for the BDMST problem. The quality of the Pareto fronts obtained from the MOGP-evolved heuristics is comparable to, or in some cases better than, the Pareto fronts generated by established, hand-crafted heuristics. MOGP is thus a very promising technique for finding heuristics for BDMSTs and more general multiobjective combinatorial optimizations.|Rajeev Kumar,Bipul Kumar Bal,Peter Rockett","58327|GECCO|2008|The node-depth encoding analysis and application to the bounded-diameter minimum spanning tree problem|The node-depth encoding has elements from direct and indirect encoding for trees which encodes trees by storing the depth of nodes in a list. Node-depth encoding applies specific search operators that is a typical characteristic for direct encodings. An investigation into the bias of the initialization process and the mutation operators of the node-depth encoding shows that the initialization process has a bias to solutions with small depths and diameters, and a bias towards stars. This investigation, also, shows that the mutation operators are unbiased. The performance of node-depth encoding is investigated for the bounded-diameter minimum spanning tree problem. The results are presented for Euclidean instances presented in the literature. In contrast with the expectation, the evolutionary algorithm using the biased initialization operator does not allow evolutionary algorithms to find better solutions compared to an unbiased initialization. In comparison to other evolutionary algorithms for the bounded-diameter minimum spanning tree evolutionary algorithms using the node-depth encoding have a good performance.|Telma Woerle de Lima,Franz Rothlauf,Alexandre C. B. Delbem","57771|GECCO|2006|An effective genetic algorithm for the minimum-label spanning tree problem|Given a connected, undirected graph G with labeled edges, the minimum label spanning tree problem seeks a spanning tree on G to whose edges are attached the smallest possible number of labels. A greedy heuristic for this NP-hard problem greedily chooses labels so as to reduce the number of components in the subgraphs they induce as quickly as possible. A genetic algorithm for the problem encodes candidate solutions as per mutations of the labels an initial segment of such a chromosome lists the labels that appear on the edges in the chromosome's tree. Three versions of the GA apply generic or heuristic crossover and mutation operators and a local search step. In tests on  randomly-generated instances of the minimum-label spanning tree problem, versions of the GA that apply generic operators, with and without the local search step, perform less well than the greedy heuristic, but a version that applies the local search step and operators tailored to the problem returns solutions that require on average  fewer labels than the heuristic's.|Jeremiah Nummela,Bryant A. Julstrom","59108|GECCO|2010|An efficient algorithm for generalized minimum spanning tree problem|The Generalized Minimum Spanning Tree problem (GMST) has attracted much attention during the last few years. Since it is in-tractable, many heuristic algorithms have been proposed to solve large GMST instances. Motivated by the effectiveness and effi-ciency of the muscle (the union of all optimal solutions) for solv-ing other NP-hard problems, we investigate how to incorporate the muscle into heuristic design for GMST. Firstly, we demon-strate that it's NP-hard to obtain the muscle for GMST. Then we show that the muscle can be well approximated by the principle and subordinate candidate sets, which can be calculated on a re-duced version of GMST. Therefore, a Dynamic cAndidate set based Search Algorithm (DASA) is presented in this paper for GMST. In contrast to existing heuristics, DASA employs those candidate sets to initialize and optimize solutions. During the search process, those candidate sets are dynamically adjusted to include in new features provided by good solutions. Since those candidate sets cover almost all optimal solutions, the search space of DASA can be dramatically reduced so that elite solutions can be easily found in a short time. Extensive experiments demon-strate that our new algorithm slightly outperforms existing heuris-tic algorithms in terms of solution quality.|He Jiang,Yudong Chen","58747|GECCO|2009|New heuristic and hybrid genetic algorithm for solving the bounded diameter minimum spanning tree problem|In this paper, we propose a new heuristic, called Center-Based Recursive Clustering - CBRC, for solving the bounded diameter minimum spanning tree (BDMST) problem. Our proposed hybrid genetic algorithm  is also extended to include the new heuristic and a multi-parent crossover operator. We test the new heuristic and genetic algorithm on two sets of benchmark problem instances for the Euclidean and Non-Euclidean cases. Experimental results show the effectiveness of the proposed heuristic and genetic algorithm.|Huynh Thi Thanh Binh,Robert I. McKay,Nguyen Xuan Hoai,Nguyen Duc Nghia","57610|GECCO|2006|An ant-based algorithm for finding degree-constrained minimum spanning tree|A spanning tree of a graph such that each vertex in the tree has degree at most d is called a degree-constrained spanning tree. The problem of finding the degree-constrained spanning tree of minimum cost in an edge weighted graphis well known to be NP-hard. In this paper we give an Ant-Based algorithm for finding low cost degree-constrained spanning trees. Ants are used to identify a set of candidate edges from which a degree-constrained spanning tree can be constructed. Extensive experimental results show that the algorithm performs very well against other algorithms on a set of  problem instances.|Thang Nguyen Bui,Catherine M. Zrncic","57677|GECCO|2006|Neighbourhood searches for the bounded diameter minimum spanning tree problem embedded in a VNS EA and ACO|We consider the Bounded Diameter Minimum Spanning Tree problem and describe four neighbourhood searches for it. They are used as local improvement strategies within a variable neighbourhood search (VNS), an evolutionary algorithm (EA) utilising a new encoding of solutions, and an ant colony optimisation (ACO). We compare the performance in terms of effectiveness between these three hybrid methods on a suite of popular benchmark instances, which contains instances too large to solve by current exact methods. Our results show that the EA and the ACO outperform the VNS on almost all used benchmark instances. Furthermore, the ACO yields most of the time better solutions than the EA in long-term runs, whereas the EA dominates when the computation time is strongly restricted.|Martin Gruber,Jano I. van Hemert,G√ºnther R. Raidl","57390|GECCO|2005|The blob code is competitive with edge-sets in genetic algorithms for the minimum routing cost spanning tree problem|Among the many codings of spanning trees for evolutionary search are those based on bijections between Prfer strings---strings of n- vertex labels---and spanning trees on the labeled vertices. One of these bijections, called the Blob Code, showed promise as an evolutionary coding, but EAs that use it to represent spanning trees have not performed well. Here, a genetic algorithm that represents spanning trees via the Blob Code is faster than, and returns results competitive with those of, a GA that encodes spanning trees as edge-sets on Euclidean instances of the minimum routing cost spanning tree problem. On instances whose edge weights have been chosen at random, the Blob-coded GA maintains its time advantage, but its results are inferior to those of the edge-set-coded GA, and both GAs are hard pressed to keep up with a simple stochastic hill-climber on all the test instances.|Bryant A. Julstrom","58676|GECCO|2009|Extending evolutionary algorithms to discover tri-criterion and non-supported solutions for the minimum spanning tree problem|The study of multi-criterion minimum spanning trees is important as many optimization problems in networks, such as communication, transport and utilities can be represented by this model. Conventional evolutionary approaches struggle to discover near-optimal solutions due to the combinatorial search space, and the difficulty in discovering the non-supported solutions. Recently, a knowledge-based evolutionary approach, KEA, has been developed that overcomes some of the problems of the earlier algorithms as it is not restricted to the bi-criterion case, finds non-supported solutions and scales well to larger problems however, the mid-point of its Pareto front is often dominated by alternative algorithms where they are applicable. Novel extensions to KEA, increasing the knowledge of the mid-point, termed KEA-W are examined, eliminating the mid-point deficiencies at the cost of computational time.|Madeleine Davis-Moradkhan,Will N. Browne,Peter Grindrod"],["57993|GECCO|2007|Context-aware mutation a modular context aware mutation operator for genetic programming|This paper introduces a new type of mutation, Context-Aware Mutation, which is inspired by the recently introduced context-aware crossover. Context-Aware mutation operates by replacing existing sub-trees with modules from a previously construct repository of possibly useful sub-trees. We describe an algorithmic way to produce the repository from an initial, exploratory run and test various GP set ups for producing the repository. The results show that when the exploratory run uses context-aware crossover and the main run uses context-aware mutation, not only is the final result significantly better, the overall cost of the runs in terms of individuals evaluated is significantly lower.|Hammad Majeed,Conor Ryan","58334|GECCO|2008|A swarm-based crossover operator for genetic programming|A swarm-based improvement to Genetic Programming (GP) is described and tested on the domain of symbolic regression in this paper. The motivating idea is to keep all of the benefits of genetic programming such as crossover and fitness proportional selection within a population of candidate solutions. The improvement comes in using swarm-based ideas similar to Ant Colony Optimization (ACO) to improve the operation of the crossover operator. Statistically significant results are reported in support of the hypothesis that ACO-inspired crossover can improve GP.|Tony White,Amirali Salehi-Abari","58258|GECCO|2008|Stress-based crossover operator for structure topology optimization using small population size and variable length chromosome|This paper talks about genetic algorithm (GA) with a stress-based crossover operator (SX) to multi-constrained structural topology optimization. By bitstring chromosome representation, the design variables are very large that result in long computation time. Population size, as the key to cut computation time, is discussed through a number of small population sized experiments. Moreover, we introduce a variable length chromosome to further optimize the topology hierarchically.|Cuimin Li,Tomoyuki Hiroyasu,Mitsunori Miki","57594|GECCO|2006|Smart crossover operator with multiple parents for a Pittsburgh learning classifier system|This paper proposes a new smart crossover operator for a Pittsburgh Learning Classifier System. This operator, unlike other recent LCS approaches of smart recombination, does not learn the structure of the domain, but it merges the rules of N parents (N  ) to generate a new offspring. This merge process uses an heuristic that selects the minimum subset of candidate rules that obtains maximum training accuracy. Moreover the operator also includes a rule pruning scheme to avoid the inclusion of over-specific rules, and to guarantee as much as possible the robust behaviour of the LCS. This operator takes advantage from the fact that each individual in a Pittsburgh LCS is a complete solution, and the system has a global view of the solution space that the proposed rule selection algorithm exploits. We have empirically evaluated this operator using a recent LCS called GAssist. First with the standard LCS benchmark, the  bits multiplexer, and later using  standard real datasets. The results of the experiments over these datasets indicate that the new operator manages to increase the accuracy of the system over the classical crossover in  of the  datasets, and never having a significantly worse performance than the classic operator.|Jaume Bacardit,Natalio Krasnogor","57640|GECCO|2006|Non-wrapping order crossover an order preserving crossover operator that respects absolute position|In this paper, we introduce a new crossover operator for the permutation representation of a GA. This new operator---Non-Wrapping Order Crossover (NWOX)---is a variation of the well-known Order Crossover (OX) operator. It strongly preserves relative order, as does the original OX, but also respects the absolute positions within the parent permutations. This crossover operator is experimentally compared to several other permutation crossover operators on an NP-Hard problem known as weighted tardiness scheduling with sequence-dependent setups. A GA using this NWOX operator finds new best known solutions for several benchmark problem instances and proves to be superior to the previous best performing metaheuristic for the problem.|Vincent A. Cicirello","58269|GECCO|2008|A Tabu history driven crossover operator design for memetic algorithm applied to Max-SAT-problems|The solution for the Max-SAT is the starting point for a selection of these strategies by a brief review. Moreover, a memetic algorithm for Max-SAT problems based on a specific crossover operator and an improved tabu search stage is presented. Simulation performed on several instances of Max-SAT reference problems are used to evaluate the different memetic algorithm strategies applied in our approach and to compare it to the computational complexity of existing local search solutions.|M. Borschbach,A. Exeler","59036|GECCO|2010|A probabilistic functional crossover operator for genetic programming|The original mechanism by which evolutionary algorithms were to solve problems was to allow for the gradual discovery of sub-solutions to sub-problems, and the automated combination of these sub-solutions into larger solutions. This latter property is particularly challenging when recombination is performed on genomes encoded as trees, as crossover events tend to greatly alter the original genomes and therefore greatly reduce the chance of the crossover event being beneficial. A number of crossover operators designed for tree-based genetic encodings have been proposed, but most consider crossing genetic components based on their structural similarity. In this work we introduce a tree-based crossover operator that probabilistically crosses branches based on the behavioral similarity between the branches. It is shown that this method outperforms genetic programming without crossover, random crossover, and a deterministic form of the crossover operator in the symbolic regression domain.|Josh C. Bongard","57431|GECCO|2005|Combining competent crossover and mutation operators a probabilistic model building approach|This paper presents an approach to combine competent crossover and mutation operators via probabilistic model building. Both operators are based on the probabilistic model building procedure of the extended compact genetic algorithm (eCGA). The model sampling procedure of eCGA, which mimics the behavior of an idealized recombination---where the building blocks (BBs) are exchanged without disruption---is used as the competent crossover operator. On the other hand, a recently proposed BB-wise mutation operator---which uses the BB partition information to perform local search in the BB space---is used as the competent mutation operator. The resulting algorithm, called hybrid extended compact genetic algorithm (heCGA), makes use of the problem decomposition information for () effective recombination of BBs and () effective local search in the BB neighborhood. The proposed approach is tested on different problems that combine the core of three well known problem difficulty dimensions deception, scaling, and noise. The results show that, in the absence of domain knowledge, the hybrid approach is more robust than either single-operator-based approach.|Cl√°udio F. Lima,Kumara Sastry,David E. Goldberg,Fernando G. Lobo","57741|GECCO|2006|A crossover operator for the anonymity problem|Recent dissemination of personal data has created an important optimization problem what is the minimal transformation of a dataset that is needed to guarantee the anonymity of the underlying individuals One natural representation for this problem is a bit-string, which makes a genetic algorithm a logical choice for optimization. Unfortunately, under certain realistic conditions, not all bit combinations will represent valid solutions. This means that in many instances, useful solutions are sparse in the search space. We implement a new crossover operator that preserves valid solutions under this representation. Our results show that this reproductive strategy is more efficient, effective, and robust than previous work. We also investigate how the population size and uniqueness can affect the performance of genetic search on this application.|Monte Lunacek,Darrell Whitley,Indrakshi Ray","57908|GECCO|2007|Variable discrimination of crossover versus mutation using parameterized modular structure|Recent work has provided functions that can be used to prove a principled distinction between the capabilities of mutation-based and crossover-based algorithms. However, prior functions are isolated problem instances that do not provide much intuition about the space of possible functions that is relevant to this distinction or the characteristics of the problem class that affect the relative success of these operators. Modularity is a ubiquitous and intuitive concept in design, engineering and optimisation, and can be used to produce functions that discriminate the ability of crossover from mutation. In this paper, we present a new approach to representing modular problems, which parameterizes the amount of modular structure that is present in the epistatic dependencies of the problem. This adjustable level of modularity can be used to give rise to tuneable discrimination of the ability of genetic algorithms with crossover versus mutation-only algorithms.|Rob Mills,Richard A. Watson"],["58308|GECCO|2008|Image registration using genetic algorithms|This paper addresses the image registration problem applying genetic algorithms. The image registration's objective is the definition of a mapping that best match two set of points or images. In this work the point matching problem was addressed employing a method based on nearest-neighbor. The mapping was handled by affine transformations. Experiments were conducted using three D synthetic point-sets with different affine transformations and noise. The results were compared against other optimization techniques. The similarity of two point-sets is measured using the Euclidean distance between matched points.|Fl√°vio Luiz Seixas,Luiz Satoru Ochi,Aura Conci,D√©bora C. Muchaluat-Saade","57632|GECCO|2006|Using a genetic algorithm to evolve cellular automata for DD computational development|Form generation or morphogenesis is one of the main stages of both artificial and natural development. This paper provides results from experiments in which a genetic algorithm (GA) was used to evolve cellular automata (CA) to produce predefined D and D shapes. The GA worked by evolving the CA rule table and the number of iterations that the model was to run. After the final chromosomes were obtained for all shapes, the CA model was allowed to run starting with a single cell in the middle of the lattice until the allowed number of iterations was reached and a shape was formed. In all cases, mean fitness values of evolved chromosomes were above .|Arturo Chavoya,Yves Duthen","58600|GECCO|2009|A population scheme using cellular automata cambrian explosions and massive extinctions|This paper describes an evolutionary algorithm (EA) which combines cellular automata, Cambrian explosions and massive extinction ideas in order to maintain diversity and automatically determine the population's size of the EA. Individuals are organized in a two-dimensional grid (-dimensional cellular automaton surface) and are considered active or inactive according to the cellular automaton state. The individual state is updated according to the cellular automaton state rules at each step (iteration) of the evolutionary process. Only active individuals are subject to evolution by applying one of the genetic operators and considering just their active neighbors (when multiple parents are required). Depending on the total number of active individuals, a Cambrian explosion or a massive extinction operation is applied, in a random fashion. When the number of active individuals increases (decreases) the probability of applying a massive extinction increases (decreases) respectively. A symmetric rule is used for Cambrian explosions. Experiments on well known genetic algorithm testbed functions and on standard traveling salesman problems were conducted. Our experiments show that the proposed scheme is able to maintain diversity and find near optimal solutions in an appropriated number of fitness evaluations.|Jonatan G√≥mez,Giovanni Cantor","57020|GECCO|2002|Hyperspectral Image Analysis Using Genetic Programming|Genetic programming is used to evolve mineral identification functions for hyperspectral images. The input image set comprises  images from different wavelengths ranging from nm (visible blue) to nm (invisible shortwave in the infrared), taken over Cuprite, Nevada, with the AVIRIS hyperspectral sensor. A composite mineral image indicating the overall reflectance percentage of three minerals (alunite, kaolnite, buddingtonite) is used as a reference or ''solution'' image. The training set is manually selected from this composite image, and results are cross-validated with the remaining image data not used for training. The task of the GP system is to evolve mineral identifiers, where each identifier is trained to identify one of the three mineral specimens. A number of different GP experiments were undertaken, which parameterized features such as thresholded mineral reflectance intensity and target GP language. The results are promising, especially for minerals with higher reflectance thresholds, which indicate more intense concentrations.|Brian J. Ross,Anthony G. Gualtieri,Frank Fueten,Paul Budkewitsch","57286|GECCO|2005|Using a genetic algorithm to evolve behavior in multi dimensional cellular automata emergence of behavior|Cellular automata are used in many fields to generate a global behavior with local rules. Finding the rules that display a desired behavior can be a hard task especially in real world problems. This paper proposes an improved approach to generate these transition rules for multi dimensional cellular automata using a genetic algorithm, thus giving a generic way to evolve global behavior with local rules, thereby mimicking nature. Three different problems are solved using multi dimensional topologies of cellular automata to show robustness, flexibility and potential. The results suggest that using multiple dimensions makes it easier to evolve desired behavior and that combining genetic algorithms with multi dimensional cellular automata is a very powerful way to evolve very diverse behavior and has great potential for real world problems.|Ron Breukelaar,Thomas B√§ck","57881|GECCO|2007|Evolution of non-uniform cellular automata using a genetic algorithm diversity and computation|We used a genetic algorithm to evaluate the cost  benefit of diversity in evolving sets of rules for non-uniform cellular automata solving the density classification problem.|Forrest Sondahl,William Rand","58383|GECCO|2008|Using PCA to improve evolutionary cellular automata algorithms|The difficulty of designing cellular automatons' transition rules to perform a particular problem has severely limited their applications. Using a genetic algorithm to evolve cellular automata for fining these rules, is a good solution. Conventional evolutionary methods use random test configurations for calculating fitness values of each transition rule. In this paper, we use Principal Component Analysis to build better test configurations. By emphasizing on diversity between test instances in a test plan, we can evaluate rules better and faster as well as increase their accuracy. In this paper, we propose two models based on this idea. Experimental results on density classification and synchronization tasks prove that our methods are more efficient than the conventional one.|Mehran Najafi,Hamid Beigy","59100|GECCO|2010|Optimization of the hlder image descriptor using a genetic algorithm|Local image features can provide the basis for robust and invariant recognition of objects and scenes. Therefore, compact and distinctive representations of local shape and appearance has become invaluable in modern computer vision. In this work, we study a local descriptor based on the Hlder exponent, a measure of signal regularity. The proposal is to find an optimal number of dimensions for the descriptor using a genetic algorithm (GA). To guide the GA search, fitness is computed based on the performance of the descriptor when applied to standard region matching problems. This criterion is quantified using the F-Measure, derived from recall and precision analysis. Results show that it is possible to reduce the size of the canonical Hlder descriptor without degrading the quality of its performance. In fact, the best descriptor found through the GA search is nearly % smaller and achieves similar performance on standard tests.|Leonardo Trujillo,Pierrick Legrand,Gustavo Olague,Cynthia B. P√©rez","58682|GECCO|2009|Development of combinational circuits using non-uniform cellular automata initial results|A non-uniform cellular automata-based model is presented for the evolutionary development of digital circuits at the gate level. The main feature of this model is the modified local transition function of the cellular automaton in which a gate is associated with each rule of the transition function. A logic gate is generated by each cell when the cell determines its next state according to the appropriate rule. An evolutionary algorithm is utilized to design a non-uniform cellular automaton (its local transition function) for the development of a target circuit. In this paper, initial results will be presented that were obtained using the non-uniform cellular automata.|Michal Bidlo,Zdenek Vas√≠cek","58293|GECCO|2008|Self-adaptive mutation rates in genetic algorithm for inverse design of cellular automata|Self-adaptation is used a lot in Evolutionary Strategies and with great success, yet for some reason it is not the mutation adaptation of choice for Genetic Algorithms. This poster describes how a self-adaptive mutation rate was used in a Genetic Algorithms to inverse design behavioral rules for a Cellular Automata. The unique characteristics of this search space gave rise to some interesting convergence behavior that might have implications for using self-adaptive mutation rates in other Genetic Algorithm applications and might clarify why self-adaptation in Genetic Algorithms is less successful than in Evolutionary Strategies.|Ron Breukelaar,Thomas B√§ck"],["58132|GECCO|2007|Self-modifying cartesian genetic programming|In nature, systems with enormous numbers of components (i.e. cells) are evolved from a relatively small genotype. It has not yet been demonstrated that artificial evolution is sufficient to make such a system evolvable. Consequently researchers have been investigating forms of computational development that may allow more evolvable systems. The approaches taken have largely used re-writing, multi- cellularity, or genetic regulation. In many cases it has been difficult to produce general purpose computation from such systems.In this paper we introduce computational development using a form of Cartesian Genetic Programming that includes self-modification operations. One advantage of this approach is that ab initio the system can be used to solve computational problems. We present results on a number of problems and demonstrate the characteristics and advantages that self-modification brings.|Simon Harding,Julian Francis Miller,Wolfgang Banzhaf","58114|GECCO|2007|Coevolution of intelligent agents using cartesian genetic programming|A coevolutionary competitive learning environment for two antagonistic agents is presented. The agents are controlled by a new kind of computational network based on a compartmentalised model of neurons. We have taken the view that the genetic basis of neurons is an important  and neglected aspect of previous approaches. Accordingly, we have defined a collection of chromosomes representing various aspects of the neuron soma, dendrites and axon branches, and synaptic connections. Chromosomes are represented and evolved using a form of genetic programming known as Cartesian Genetic Programming. The network formed by running the chromosomal programs has a highly dynamic morphology in which neurons grow, and die, and neurite branches together with synaptic connections form and change in response to environmental interactions. The idea of this paper is to demonstrate the importance of the genetic transfer of learned experience and life time learning. The learning is a consequence of the complex dynamics produced as a result of interaction (coevolution) between two intelligent agents. Our results show that both agents exhibit interesting learning capabilities.|Gul Muhammad Khan,Julian Francis Miller,David M. Halliday","57974|GECCO|2007|Trading rules on stock markets using genetic network programming with sarsa learning|In this paper, the Genetic Network Programming (GNP) for creating trading rules on stocks is described. GNP is an evolutionary computation, which represents its solutions using graph structures and has some useful features inherently. It has been clarified that GNP works well especially in dynamic environments since GNP can create quite compact programs and has an implicit memory function. In this paper, GNP is applied to creating a stock trading model. There are three important points The first important point is to combine GNP with Sarsa Learning which is one of the reinforcement learning algorithms. Evolution-based methods evolve their programs after task execution because they must calculate fitness values, while reinforcement learning can change programs during task execution, therefore the programs can be created efficiently. The second important point is that GNP uses candlestick chart and selects appropriate technical indices to judge the buying and selling timing of stocks. The third important point is that sub-nodes are used in each node to determine appropriate actions (buyingselling) and to select appropriate stock price information depending on the situation. In the simulations, the trading model is trained using the stock prices of  brands in ,  and . Then the generalization ability is tested using the stock prices in . From the simulation results, it is clarified that the trading rules of the proposed method obtain much higher profits than Buy&Hold method and its effectiveness has been confirmed.|Yan Chen,Shingo Mabu,Kotaro Hirasawa,Jinglu Hu","57960|GECCO|2007|A new crossover technique for Cartesian genetic programming|Genetic Programming was first introduced by Koza using tree representation together with a crossover technique in which random sub-branches of the parents' trees are swapped to create the offspring. Later Miller and Thomson introduced Cartesian Genetic Programming, which uses directed graphs as a representation to replace the tree structures originally introduced by Koza. Cartesian Genetic Programming has been shown to perform better than the traditional Genetic Programming but it does not use crossover to create offspring, it is implemented using mutation only. In this paper a new crossover method in Genetic Programming is introduced. The new technique is based on an adaptation of the Cartesian Genetic Programming representation and is tested on two simple regression problems. It is shown that by implementing the new crossover technique, convergence is faster than that of using mutation only in the Cartesian Genetic Programming method.|Janet Clegg,James Alfred Walker,Julian Francis Miller","58106|GECCO|2007|Linear genetic programming of metaheuristics|We suggest a flavour of linear Genetic Programming indomain-specific languages that acts as a hyperheuristic (HH).|Robert E. Keller,Riccardo Poli","58816|GECCO|2009|Finding attractive rules in stock markets using a modular genetic programming|We propose a new modular genetic programming for finding attractive and statistically sound technical rules. We restrict the problem space using well-known technical rules to discover attractive technical rules. Experimental results show that our modular genetic programming can successfully find unknown attractive technical rules for Korean stock market.|Seung-Kyu Lee,Byung Ro Moon","58433|GECCO|2008|Combining cartesian genetic programming with an estimation of distribution algorithm|This paper describes initial testing of a novel idea to combine a CGP with an EDA. In recent work a new improved crossover technique was successfully applied to a CGP. To implement the new method meant changing the traditional CGP representation. The new representation developed in that work lends itself very nicely to some probability distribution being implemented. The work in this paper has investigated this idea of incoporating estimated probability distributions into the new CGP method with crossover.|Janet Clegg","58332|GECCO|2008|Fault tolerant control using Cartesian genetic programming|The paper focuses on the evolution of algorithms for control of a machine in the presence of sensor faults, using Cartesian Genetic Programming. The key challenges in creating training sets and a fitness function that encourage a general solution are discussed. The evolved algorithms are analysed and discussed. It was found that highly novel, mathematically elegant and hitherto unknown solutions were found.|Yoshikazu Hirayama,Tim Clarke,Julian Francis Miller","57990|GECCO|2007|Solving real-valued optimisation problems using cartesian genetic programming|Classical Evolutionary Programming (CEP) and Fast Evolutionary Programming (FEP) have been applied to real-valued function optimisation. Both of these techniques directly evolve the real-values that are the arguments of the real-valued function. In this paper we have applied a form of genetic programming called Cartesian Genetic Programming (CGP) to a number of real-valued optimisation benchmark problems. The approach we have taken is to evolve a computer program that controls a writing-head, which moves along and interacts with a finite set of symbols that are interpreted as real numbers, instead of manipulating the real numbers directly. In other studies, CGP has already been shown to benefit from a high degree of neutrality. We hope to exploit this for real-valued function optimisation problems to avoid being trapped on local optima. We have also used an extended form of CGP called Embedded CGP (ECGP) which allows the acquisition, evolution and re-use of modules. The effectiveness of CGP and ECGP are compared and contrasted with CEP and FEP on the benchmark problems. Results show that the new techniques are very effective.|James Alfred Walker,Julian Francis Miller","57561|GECCO|2005|Investigating the performance of module acquisition in cartesian genetic programming|Embedded Cartesian Genetic Programming (ECGP) is a form of the graph based Cartesian Genetic Programming (CGP) in which modules are automatically acquired and evolved. In this paper we compare the efficiencies of the ECGP and CGP techniques on three classes of problem digital adders, digital multipliers and digital comparators. We show that in most cases ECGP shows a substantial improvement in performance over CGP and that the computational speedup is more pronounced on larger problems.|James Alfred Walker,Julian Francis Miller"]]}}